[Killed] BlockStatement
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.js:42:35
 
   // Stryker restore all
 
-  const handleSubmit = (event) => {
-    event.preventDefault();
-    fetchJSON(event, { startQuarter, endQuarter, buildingCode });
-  };
+  const handleSubmit = (event) => {};
 
   return (
killedBy: CourseOverTimeBuildingsSearchForm tests when I click submit, the right stuff happens
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.js:44:22
 
   const handleSubmit = (event) => {
     event.preventDefault();
-    fetchJSON(event, { startQuarter, endQuarter, buildingCode });
+    fetchJSON(event, {});
   };
 
killedBy: CourseOverTimeBuildingsSearchForm tests when I click submit, the right stuff happens
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "buildingCode": "GIRV",

[Killed] StringLiteral
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.js:57:22
               quarter={startQuarter}
               setQuarter={setStartQuarter}
               controlId={"CourseOverTimeBuildingsSearch.StartQuarter"}
-              label={"Start Quarter"}
+              label={""}
             />
           </Col>
killedBy: CourseOverTimeBuildingsSearchForm tests when I select a start quarter, the state for start quarter changes
statusReason: TestingLibraryElementError: Unable to find a label with the text of: Start Quarter

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
