[Survived] BooleanLiteral
main/pages/Admin/AdminJobsPage.js:24:44
   const [page, setPage] = useState(0);
 
   const [sortField, setSortField] = useState("createdAt");
-  const [sortDesc, setSortDesc] = useState(true);
+  const [sortDesc, setSortDesc] = useState(false);
 
   const [loading, setLoading] = useState(false);

[Survived] BooleanLiteral
main/pages/Admin/AdminJobsPage.js:26:42
   const [sortField, setSortField] = useState("createdAt");
   const [sortDesc, setSortDesc] = useState(true);
 
-  const [loading, setLoading] = useState(false);
+  const [loading, setLoading] = useState(true);
   const [error, setError] = useState(null);
 

[Survived] BooleanLiteral
main/pages/Admin/AdminJobsPage.js:30:16
   const [error, setError] = useState(null);
 
   const fetchJobs = useCallback(async () => {
-    setLoading(true);
+    setLoading(false);
     setError(null);
     try {

[Killed] BlockStatement
main/pages/Admin/AdminJobsPage.js:32:9
   const fetchJobs = useCallback(async () => {
     setLoading(true);
     setError(null);
-    try {
-      const res = await axios.get("/api/jobs/all", {
-        params: {
-          page,
-          size: 10,
-          sortField,
-          sortDir: sortDesc ? "DESC" : "ASC",
-        },
-      });
-
-      const data = res.data;
-      if (Array.isArray(data)) {
-        setJobs(data);
-        setTotalPages(1);
-      } else if (data.content && Array.isArray(data.content)) {
-        setJobs(data.content);
-        setTotalPages(data.totalPages ?? 1);
-      } else {
-        setJobs([]);
-        setTotalPages(1);
-      }
-    } catch (e) {
+    try {} catch (e) {
       console.error(e);
       setError("Error fetching jobs");
killedBy: AdminJobsPage tests error fetching jobs displays error message
statusReason: Error: Unable to find an element with the text: /Error fetching jobs/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/Admin/AdminJobsPage.js:33:52
     setLoading(true);
     setError(null);
     try {
-      const res = await axios.get("/api/jobs/all", {
-        params: {
-          page,
-          size: 10,
-          sortField,
-          sortDir: sortDesc ? "DESC" : "ASC",
-        },
-      });
+      const res = await axios.get("/api/jobs/all", {});
 
       const data = res.data;
killedBy: AdminJobsPage tests clicking a pagination item fetches the correct page param
statusReason: Error: Unable to find role="button" and name "2"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/Admin/AdminJobsPage.js:43:32
       });
 
       const data = res.data;
-      if (Array.isArray(data)) {
-        setJobs(data);
-        setTotalPages(1);
-      } else if (data.content && Array.isArray(data.content)) {
+      if (Array.isArray(data)) {} else if (data.content && Array.isArray(data.content)) {
         setJobs(data.content);
         setTotalPages(data.totalPages ?? 1);
killedBy: AdminJobsPage tests handles plain array data shape (Array.isArray)
statusReason: Error: Unable to find an element by: [data-testid="JobsTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Admin/AdminJobsPage.js:43:11
       });
 
       const data = res.data;
-      if (Array.isArray(data)) {
+      if (false) {
         setJobs(data);
         setTotalPages(1);
killedBy: AdminJobsPage tests handles plain array data shape (Array.isArray)
statusReason: Error: Unable to find an element by: [data-testid="JobsTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/Admin/AdminJobsPage.js:46:63
       if (Array.isArray(data)) {
         setJobs(data);
         setTotalPages(1);
-      } else if (data.content && Array.isArray(data.content)) {
-        setJobs(data.content);
-        setTotalPages(data.totalPages ?? 1);
-      } else {
+      } else if (data.content && Array.isArray(data.content)) {} else {
         setJobs([]);
         setTotalPages(1);
killedBy: AdminJobsPage tests totalPages > 1 renders pagination items equal to totalPages
statusReason: Error: Unable to find role="listitem"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Admin/AdminJobsPage.js:46:18
       if (Array.isArray(data)) {
         setJobs(data);
         setTotalPages(1);
-      } else if (data.content && Array.isArray(data.content)) {
+      } else if (false) {
         setJobs(data.content);
         setTotalPages(data.totalPages ?? 1);
killedBy: AdminJobsPage tests totalPages > 1 renders pagination items equal to totalPages
statusReason: Error: Unable to find role="listitem"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/Admin/AdminJobsPage.js:48:23
         setTotalPages(1);
       } else if (data.content && Array.isArray(data.content)) {
         setJobs(data.content);
-        setTotalPages(data.totalPages ?? 1);
+        setTotalPages(data.totalPages && 1);
       } else {
         setJobs([]);
killedBy: AdminJobsPage tests totalPages > 1 renders pagination items equal to totalPages
statusReason: Error: Unable to find role="listitem"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Survived] BlockStatement
main/pages/Admin/AdminJobsPage.js:49:14
       } else if (data.content && Array.isArray(data.content)) {
         setJobs(data.content);
         setTotalPages(data.totalPages ?? 1);
-      } else {
-        setJobs([]);
-        setTotalPages(1);
-      }
+      } else {}
     } catch (e) {
       console.error(e);

[Killed] BlockStatement
main/pages/Admin/AdminJobsPage.js:53:17
         setJobs([]);
         setTotalPages(1);
       }
-    } catch (e) {
-      console.error(e);
-      setError("Error fetching jobs");
-    } finally {
+    } catch (e) {} finally {
       setLoading(false);
     }
killedBy: AdminJobsPage tests error fetching jobs displays error message
statusReason: Error: Unable to find an element with the text: /Error fetching jobs/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Timeout] BlockStatement
main/pages/Admin/AdminJobsPage.js:56:15
     } catch (e) {
       console.error(e);
       setError("Error fetching jobs");
-    } finally {
-      setLoading(false);
-    }
+    } finally {}
   }, [page, sortField, sortDesc]);
 

[Killed] ArrayDeclaration
main/pages/Admin/AdminJobsPage.js:59:6
     } finally {
       setLoading(false);
     }
-  }, [page, sortField, sortDesc]);
+  }, []);
 
   useEffect(() => {
killedBy: AdminJobsPage tests clicking a pagination item fetches the correct page param
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/Admin/AdminJobsPage.js:61:19
     }
   }, [page, sortField, sortDesc]);
 
-  useEffect(() => {
-    fetchJobs();
-  }, [fetchJobs]);
+  useEffect(() => {}, [fetchJobs]);
 
   useEffect(() => {
killedBy: AdminJobsPage tests error fetching jobs displays error message
statusReason: Error: Unable to find an element with the text: /Error fetching jobs/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/Admin/AdminJobsPage.js:65:19
     fetchJobs();
   }, [fetchJobs]);
 
-  useEffect(() => {
-    const iv = setInterval(fetchJobs, REFRESH_MS);
-    return () => clearInterval(iv);
-  }, [fetchJobs]);
+  useEffect(() => {}, [fetchJobs]);
 
   const handlePurge = async () => {
killedBy: AdminJobsPage tests auto-refresh triggers repeated fetchJobs calls
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1

Ignored nodes: comments, script, style
<html>

[Survived] ArrowFunction
main/pages/Admin/AdminJobsPage.js:67:12
 
   useEffect(() => {
     const iv = setInterval(fetchJobs, REFRESH_MS);
-    return () => clearInterval(iv);
+    return () => undefined;
   }, [fetchJobs]);
 

[Killed] BlockStatement
main/pages/Admin/AdminJobsPage.js:70:35
     return () => clearInterval(iv);
   }, [fetchJobs]);
 
-  const handlePurge = async () => {
-    await axios.delete("/api/jobs/all");
-    setPage(0);
-    fetchJobs();
-  };
+  const handlePurge = async () => {};
 
   const handleSortChange = (field) => {
killedBy: AdminJobsPage tests user can purge all jobs in the JobsTable
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
main/pages/Admin/AdminJobsPage.js:76:39
     fetchJobs();
   };
 
-  const handleSortChange = (field) => {
-    if (sortField === field) {
-      setSortDesc((prev) => !prev);
-    } else {
-      setSortField(field);
-      setSortDesc(false);
-    }
-    setPage(0);
-  };
+  const handleSortChange = (field) => {};
 
   const paginationItems = [];
killedBy: AdminJobsPage tests AdminJobsPage edge-case tests toggles sortField and sortDir when clicking on Created column header
statusReason: Error: expect(received).toBeDefined()

Received: undefined

Ignored nodes: comments, script, style
<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/Admin/AdminJobsPage.js:77:30
   };
 
   const handleSortChange = (field) => {
-    if (sortField === field) {
-      setSortDesc((prev) => !prev);
-    } else {
+    if (sortField === field) {} else {
       setSortField(field);
       setSortDesc(false);
killedBy: AdminJobsPage tests AdminJobsPage edge-case tests toggles sortField and sortDir when clicking on Created column header
statusReason: Error: expect(received).toBeDefined()

Received: undefined

Ignored nodes: comments, script, style
<html>
  <head />
  <body>

[Survived] ConditionalExpression
main/pages/Admin/AdminJobsPage.js:77:9
   };
 
   const handleSortChange = (field) => {
-    if (sortField === field) {
+    if (false) {
       setSortDesc((prev) => !prev);
     } else {

[Killed] BooleanLiteral
main/pages/Admin/AdminJobsPage.js:78:29
 
   const handleSortChange = (field) => {
     if (sortField === field) {
-      setSortDesc((prev) => !prev);
+      setSortDesc((prev) => prev);
     } else {
       setSortField(field);
killedBy: AdminJobsPage tests AdminJobsPage edge-case tests toggles sortField and sortDir when clicking on Created column header
statusReason: Error: expect(received).toBeDefined()

Received: undefined

Ignored nodes: comments, script, style
<html>
  <head />
  <body>

[Survived] ArrowFunction
main/pages/Admin/AdminJobsPage.js:78:19
 
   const handleSortChange = (field) => {
     if (sortField === field) {
-      setSortDesc((prev) => !prev);
+      setSortDesc(() => undefined);
     } else {
       setSortField(field);

[Survived] BlockStatement
main/pages/Admin/AdminJobsPage.js:79:12
   const handleSortChange = (field) => {
     if (sortField === field) {
       setSortDesc((prev) => !prev);
-    } else {
-      setSortField(field);
-      setSortDesc(false);
-    }
+    } else {}
     setPage(0);
   };

[Survived] BooleanLiteral
main/pages/Admin/AdminJobsPage.js:81:19
       setSortDesc((prev) => !prev);
     } else {
       setSortField(field);
-      setSortDesc(false);
+      setSortDesc(true);
     }
     setPage(0);

[Killed] ConditionalExpression
main/pages/Admin/AdminJobsPage.js:87:19
   };
 
   const paginationItems = [];
-  for (let i = 0; i < totalPages; i++) {
+  for (let i = 0; false; i++) {
     paginationItems.push(
       <Pagination.Item key={i} active={i === page} onClick={() => setPage(i)}>
killedBy: AdminJobsPage tests totalPages > 1 renders pagination items equal to totalPages
statusReason: Error: Unable to find role="listitem"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/Admin/AdminJobsPage.js:87:40
   };
 
   const paginationItems = [];
-  for (let i = 0; i < totalPages; i++) {
-    paginationItems.push(
-      <Pagination.Item key={i} active={i === page} onClick={() => setPage(i)}>
-        {i + 1}
-      </Pagination.Item>,
-    );
-  }
+  for (let i = 0; i < totalPages; i++) {}
 
   const jobLaunchers = [
killedBy: AdminJobsPage tests totalPages > 1 renders pagination items equal to totalPages
statusReason: Error: Unable to find role="listitem"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] EqualityOperator
main/pages/Admin/AdminJobsPage.js:89:40
   const paginationItems = [];
   for (let i = 0; i < totalPages; i++) {
     paginationItems.push(
-      <Pagination.Item key={i} active={i === page} onClick={() => setPage(i)}>
+      <Pagination.Item key={i} active={i !== page} onClick={() => setPage(i)}>
         {i + 1}
       </Pagination.Item>,
killedBy: AdminJobsPage tests clicking a pagination item fetches the correct page param
statusReason: Error: Unable to find role="button" and name "2"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/Admin/AdminJobsPage.js:89:61
   const paginationItems = [];
   for (let i = 0; i < totalPages; i++) {
     paginationItems.push(
-      <Pagination.Item key={i} active={i === page} onClick={() => setPage(i)}>
+      <Pagination.Item key={i} active={i === page} onClick={() => undefined}>
         {i + 1}
       </Pagination.Item>,
killedBy: AdminJobsPage tests clicking a pagination item fetches the correct page param
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ArithmeticOperator
main/pages/Admin/AdminJobsPage.js:90:10
   for (let i = 0; i < totalPages; i++) {
     paginationItems.push(
       <Pagination.Item key={i} active={i === page} onClick={() => setPage(i)}>
-        {i + 1}
+        {i - 1}
       </Pagination.Item>,
     );
killedBy: AdminJobsPage tests clicking a pagination item fetches the correct page param
statusReason: Error: Unable to find role="button" and name "2"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/Admin/AdminJobsPage.js:100:25
       name: "Test Job",
       form: (
         <TestJobForm
-          submitAction={async (d) =>
-            axios.post(
-              `/api/jobs/launch/testjob?fail=${d.fail}&sleepMs=${d.sleepMs}`,
-            )
+          submitAction={() => undefined
           }
         />
killedBy: AdminJobsPage tests user can submit a test job
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

Ignored nodes: comments, script, style
<html>

[Killed] ObjectLiteral
main/pages/Admin/AdminJobsPage.js:108:5
         />
       ),
     },
-    {
-      name: "Update Courses Database",
-      form: (
-        <UpdateCoursesJobForm
-          callback={async (d) =>
-            axios.post(
-              `/api/jobs/launch/updateCourses?quarterYYYYQ=${d.quarter}&subjectArea=${d.subject}&ifStale=${d.ifStale}`,
-            )
-          }
-        />
-      ),
-    },
+    {},
     {
       name: "Update Courses Database by quarter",
killedBy: AdminJobsPage tests user can submit the update course data job
statusReason: Error: Unable to find an element with the text: Update Courses Database. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/Admin/AdminJobsPage.js:112:21
       name: "Update Courses Database",
       form: (
         <UpdateCoursesJobForm
-          callback={async (d) =>
-            axios.post(
-              `/api/jobs/launch/updateCourses?quarterYYYYQ=${d.quarter}&subjectArea=${d.subject}&ifStale=${d.ifStale}`,
-            )
+          callback={() => undefined
           }
         />
killedBy: AdminJobsPage tests user can submit the update course data job
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
main/pages/Admin/AdminJobsPage.js:114:15
         <UpdateCoursesJobForm
           callback={async (d) =>
             axios.post(
-              `/api/jobs/launch/updateCourses?quarterYYYYQ=${d.quarter}&subjectArea=${d.subject}&ifStale=${d.ifStale}`,
+              ``,
             )
           }
killedBy: AdminJobsPage tests user can submit the update course data job
statusReason: Error: Request failed with status code 404

[Killed] ObjectLiteral
main/pages/Admin/AdminJobsPage.js:120:5
         />
       ),
     },
-    {
-      name: "Update Courses Database by quarter",
-      form: (
-        <UpdateCoursesByQuarterJobForm
-          callback={async (d) =>
-            axios.post(
-              `/api/jobs/launch/updateQuarterCourses?quarterYYYYQ=${d.quarter}&ifStale=${d.ifStale}`,
-            )
-          }
-        />
-      ),
-    },
+    {},
     {
       name: "Update Courses Database by quarter range",
killedBy: AdminJobsPage tests user can submit the update course data by quarter job
statusReason: Error: Unable to find an element with the text: Update Courses Database by quarter. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/Admin/AdminJobsPage.js:124:21
       name: "Update Courses Database by quarter",
       form: (
         <UpdateCoursesByQuarterJobForm
-          callback={async (d) =>
-            axios.post(
-              `/api/jobs/launch/updateQuarterCourses?quarterYYYYQ=${d.quarter}&ifStale=${d.ifStale}`,
-            )
+          callback={() => undefined
           }
         />
killedBy: AdminJobsPage tests user can submit the update course data by quarter job
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

Ignored nodes: comments, script, style
<html>

[Killed] ObjectLiteral
main/pages/Admin/AdminJobsPage.js:132:5
         />
       ),
     },
-    {
-      name: "Update Courses Database by quarter range",
-      form: (
-        <UpdateCoursesByQuarterRangeJobForm
-          callback={async (d) =>
-            axios.post(
-              `/api/jobs/launch/updateCoursesRangeOfQuarters?start_quarterYYYYQ=${d.startQuarter}&end_quarterYYYYQ=${d.endQuarter}&ifStale=${d.ifStale}`,
-            )
-          }
-        />
-      ),
-    },
+    {},
     {
       name: "Update Grade Info",
killedBy: AdminJobsPage tests user can submit the update course data by quarter range job
statusReason: Error: Unable to find an element with the text: Update Courses Database by quarter range. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/Admin/AdminJobsPage.js:136:21
       name: "Update Courses Database by quarter range",
       form: (
         <UpdateCoursesByQuarterRangeJobForm
-          callback={async (d) =>
-            axios.post(
-              `/api/jobs/launch/updateCoursesRangeOfQuarters?start_quarterYYYYQ=${d.startQuarter}&end_quarterYYYYQ=${d.endQuarter}&ifStale=${d.ifStale}`,
-            )
+          callback={() => undefined
           }
         />
killedBy: AdminJobsPage tests user can submit the update course data by quarter range job
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
main/pages/Admin/AdminJobsPage.js:138:15
         <UpdateCoursesByQuarterRangeJobForm
           callback={async (d) =>
             axios.post(
-              `/api/jobs/launch/updateCoursesRangeOfQuarters?start_quarterYYYYQ=${d.startQuarter}&end_quarterYYYYQ=${d.endQuarter}&ifStale=${d.ifStale}`,
+              ``,
             )
           }
killedBy: AdminJobsPage tests user can submit the update course data by quarter range job
statusReason: Error: Request failed with status code 404

[Killed] ArrowFunction
main/pages/Admin/AdminJobsPage.js:148:21
       name: "Update Grade Info",
       form: (
         <SingleButtonJobForm
-          callback={async () => axios.post("/api/jobs/launch/uploadGradeData")}
+          callback={() => undefined}
           text="Update Grades"
         />
killedBy: AdminJobsPage tests user can submit update grade info
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

Ignored nodes: comments, script, style
<html>

[Killed] ArrowFunction
main/pages/Admin/AdminJobsPage.js:159:27
     <BasicLayout>
       <h2 className="p-3">Launch Jobs</h2>
       <Accordion>
-        {jobLaunchers.map((jl, idx) => (
-          <Accordion.Item eventKey={String(idx)} key={idx}>
-            <Accordion.Header>{jl.name}</Accordion.Header>
-            <Accordion.Body>{jl.form}</Accordion.Body>
-          </Accordion.Item>
-        ))}
+        {jobLaunchers.map(() => undefined)}
       </Accordion>
 
killedBy: AdminJobsPage tests user can submit a test job
statusReason: Error: Unable to find an element with the text: Test Job. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/Admin/AdminJobsPage.js:177:8
         onPurge={handlePurge}
       />
 
-      {totalPages > 1 && (
-        <Pagination className="justify-content-center mt-3">
-          {paginationItems}
-        </Pagination>
-      )}
+      {totalPages > 1 || <Pagination className="justify-content-center mt-3">
+          {paginationItems}
+        </Pagination>}
     </BasicLayout>
   );
killedBy: AdminJobsPage tests totalPages = 1 does not render pagination items
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [<li class="page-item active"><span class="page-link">1<span class="visually-hidden">(current)</span></span></li>]

[Killed] ConditionalExpression
main/pages/Admin/AdminJobsPage.js:177:8
         onPurge={handlePurge}
       />
 
-      {totalPages > 1 && (
-        <Pagination className="justify-content-center mt-3">
-          {paginationItems}
-        </Pagination>
-      )}
+      {false}
     </BasicLayout>
   );
killedBy: AdminJobsPage tests totalPages > 1 renders pagination items equal to totalPages
statusReason: Error: Unable to find role="listitem"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
