[Killed] BlockStatement
pages/GeneralEducation/Search/GeneralEducationSearchPage.js:4:54
 import React from "react";
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function GeneralEducationSearchPage() {
-  return (
-    <BasicLayout>
-      <div className="container mt-3">
-        <h1>GE Search coming soon!</h1>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function GeneralEducationSearchPage() {}
 
killedBy: GeneralEducationSearchPage tests renders without crashing and shows placeholder text
statusReason: TestingLibraryElementError: Unable to find an element with the text: /GE Search coming soon!/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
