[Killed] BlockStatement
main/components/PersonalSchedules/PersonalScheduleEvent.js:15:42
 
   const testId = "SchedulerEvent";
 
-  const convertTimeToMinutes = (time) => {
-    const [timePart, modifier] = [time.slice(0, -2), time.slice(-2)];
-    let [hours, minutes] = timePart.split(":").map(Number);
-
-    if (modifier === "PM" && hours !== 12) {
-      hours += 12;
-    } else if (modifier === "AM" && hours === 12) {
-      hours = 0;
-    }
-
-    return hours * 60 + minutes;
-  };
+  const convertTimeToMinutes = (time) => {};
 
   // Stryker disable all : hard to test for specfic styles
killedBy: PersonalSchedulesWeeklyViewPage tests shows the correct info for admin users
statusReason: Error: Unable to find an element with the text: ECE 1A (0100). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] MethodExpression
main/components/PersonalSchedules/PersonalScheduleEvent.js:16:54
   const testId = "SchedulerEvent";
 
   const convertTimeToMinutes = (time) => {
-    const [timePart, modifier] = [time.slice(0, -2), time.slice(-2)];
+    const [timePart, modifier] = [time.slice(0, -2), time];
     let [hours, minutes] = timePart.split(":").map(Number);
 
killedBy: PersonalScheduleEvent tests handles different AM/PM time formats for style calculation
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchedulerEvent-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
      data-testid="SchedulerEvent-event-midday"

[Killed] UnaryOperator
main/components/PersonalSchedules/PersonalScheduleEvent.js:16:65
   const testId = "SchedulerEvent";
 
   const convertTimeToMinutes = (time) => {
-    const [timePart, modifier] = [time.slice(0, -2), time.slice(-2)];
+    const [timePart, modifier] = [time.slice(0, -2), time.slice(+2)];
     let [hours, minutes] = timePart.split(":").map(Number);
 
killedBy: PersonalScheduleEvent tests handles different AM/PM time formats for style calculation
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchedulerEvent-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
      data-testid="SchedulerEvent-event-midday"

[Killed] ConditionalExpression
main/components/PersonalSchedules/PersonalScheduleEvent.js:19:9
     const [timePart, modifier] = [time.slice(0, -2), time.slice(-2)];
     let [hours, minutes] = timePart.split(":").map(Number);
 
-    if (modifier === "PM" && hours !== 12) {
+    if (false) {
       hours += 12;
     } else if (modifier === "AM" && hours === 12) {
killedBy: PersonalScheduleEvent tests handles different AM/PM time formats for style calculation
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchedulerEvent-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
      data-testid="SchedulerEvent-event-midday"

[Killed] BlockStatement
main/components/PersonalSchedules/PersonalScheduleEvent.js:19:44
     const [timePart, modifier] = [time.slice(0, -2), time.slice(-2)];
     let [hours, minutes] = timePart.split(":").map(Number);
 
-    if (modifier === "PM" && hours !== 12) {
-      hours += 12;
-    } else if (modifier === "AM" && hours === 12) {
+    if (modifier === "PM" && hours !== 12) {} else if (modifier === "AM" && hours === 12) {
       hours = 0;
     }
killedBy: PersonalScheduleEvent tests handles different AM/PM time formats for style calculation
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchedulerEvent-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
      data-testid="SchedulerEvent-event-midday"

[Killed] AssignmentOperator
main/components/PersonalSchedules/PersonalScheduleEvent.js:20:7
     let [hours, minutes] = timePart.split(":").map(Number);
 
     if (modifier === "PM" && hours !== 12) {
-      hours += 12;
+      hours -= 12;
     } else if (modifier === "AM" && hours === 12) {
       hours = 0;
killedBy: PersonalScheduleEvent tests handles different AM/PM time formats for style calculation
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchedulerEvent-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
      data-testid="SchedulerEvent-event-midday"

[Survived] EqualityOperator
main/components/PersonalSchedules/PersonalScheduleEvent.js:21:37
 
     if (modifier === "PM" && hours !== 12) {
       hours += 12;
-    } else if (modifier === "AM" && hours === 12) {
+    } else if (modifier === "AM" && hours !== 12) {
       hours = 0;
     }

[Survived] EqualityOperator
main/components/PersonalSchedules/PersonalScheduleEvent.js:21:16
 
     if (modifier === "PM" && hours !== 12) {
       hours += 12;
-    } else if (modifier === "AM" && hours === 12) {
+    } else if (modifier !== "AM" && hours === 12) {
       hours = 0;
     }

[Killed] ArithmeticOperator
main/components/PersonalSchedules/PersonalScheduleEvent.js:25:12
       hours = 0;
     }
 
-    return hours * 60 + minutes;
+    return hours / 60 + minutes;
   };
 
killedBy: PersonalScheduleEvent tests renders title and time on card if event duration is sufficient
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchedulerEvent-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
      data-testid="SchedulerEvent-test-event-1"

[Killed] ArithmeticOperator
main/components/PersonalSchedules/PersonalScheduleEvent.js:25:12
       hours = 0;
     }
 
-    return hours * 60 + minutes;
+    return hours * 60 - minutes;
   };
 
killedBy: PersonalSchedulesWeeklyViewPage tests shows the correct info for admin users
statusReason: Error: Unable to find an element with the text: ECE 1A (0100). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/components/PersonalSchedules/PersonalScheduleEvent.js:86:14
               <br />
               {event.description}
             </p>
-            {event.actions &&
-              event.actions.map((action, index) => (
-                <ButtonGroup key={index}>
-                  <Button variant={action.variant} onClick={action.callback}>
-                    {action.text}
-                  </Button>
-                </ButtonGroup>
-              ))}
+            {false}
           </Popover.Body>
         </Popover>
killedBy: PersonalScheduleEvent tests renders action buttons in popover and calls callback on click
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "button" and name "Test Action"

Here are the accessible roles:

  heading:

  Name "CS 156":
  <h3

[Killed] LogicalOperator
main/components/PersonalSchedules/PersonalScheduleEvent.js:86:14
               <br />
               {event.description}
             </p>
-            {event.actions &&
-              event.actions.map((action, index) => (
-                <ButtonGroup key={index}>
-                  <Button variant={action.variant} onClick={action.callback}>
-                    {action.text}
-                  </Button>
-                </ButtonGroup>
-              ))}
+            {event.actions || event.actions.map((action, index) => <ButtonGroup key={index}>
+                  <Button variant={action.variant} onClick={action.callback}>
+                    {action.text}
+                  </Button>
+                </ButtonGroup>)}
           </Popover.Body>
         </Popover>
killedBy: PersonalScheduleEvent tests renders without crashing for a standard event
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
main/components/PersonalSchedules/PersonalScheduleEvent.js:87:33
               {event.description}
             </p>
             {event.actions &&
-              event.actions.map((action, index) => (
-                <ButtonGroup key={index}>
-                  <Button variant={action.variant} onClick={action.callback}>
-                    {action.text}
-                  </Button>
-                </ButtonGroup>
-              ))}
+              event.actions.map(() => undefined)}
           </Popover.Body>
         </Popover>
killedBy: PersonalScheduleEvent tests renders action buttons in popover and calls callback on click
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "button" and name "Test Action"

Here are the accessible roles:

  heading:

  Name "CS 156":
  <h3

[Killed] StringLiteral
main/components/PersonalSchedules/PersonalScheduleEvent.js:101:22
       <Card
         key={event.title}
         style={style.event}
-        data-testid={`${testId}-${event.id}`}
+        data-testid={``}
       >
         <Card.Body style={style.padding5}>
killedBy: PersonalScheduleEvent tests renders without crashing for a standard event
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchedulerEvent-test-event-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
      data-testid=""

[Killed] ConditionalExpression
main/components/PersonalSchedules/PersonalScheduleEvent.js:104:12
         data-testid={`${testId}-${event.id}`}
       >
         <Card.Body style={style.padding5}>
-          {style.height >= 20 && (
-            <Card.Text data-testid={`${testId}-title`} style={style.title}>
-              {event.title}
-            </Card.Text>
-          )}
+          {false}
           {style.height >= 40 && (
             <Card.Text
killedBy: PersonalScheduleEvent tests renders title and time on card if event duration is sufficient
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchedulerEvent-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
      data-testid="SchedulerEvent-test-event-1"

[Killed] LogicalOperator
main/components/PersonalSchedules/PersonalScheduleEvent.js:104:12
         data-testid={`${testId}-${event.id}`}
       >
         <Card.Body style={style.padding5}>
-          {style.height >= 20 && (
-            <Card.Text data-testid={`${testId}-title`} style={style.title}>
-              {event.title}
-            </Card.Text>
-          )}
+          {style.height >= 20 || <Card.Text data-testid={`${testId}-title`} style={style.title}>
+              {event.title}
+            </Card.Text>}
           {style.height >= 40 && (
             <Card.Text
killedBy: PersonalScheduleEvent tests renders title and time on card if event duration is sufficient
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchedulerEvent-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
      data-testid="SchedulerEvent-test-event-1"

[Killed] ConditionalExpression
main/components/PersonalSchedules/PersonalScheduleEvent.js:109:12
               {event.title}
             </Card.Text>
           )}
-          {style.height >= 40 && (
-            <Card.Text
-              data-testid={`${testId}-time`}
-              style={{ fontSize: "12px", textAlign: "left" }}
-            >
-              {event.startTime} - {event.endTime}
-            </Card.Text>
-          )}
+          {true}
         </Card.Body>
       </Card>
killedBy: PersonalScheduleEvent tests renders title and time on card if event duration is sufficient
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchedulerEvent-time"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
      data-testid="SchedulerEvent-test-event-1"

[Survived] StringLiteral
main/components/PersonalSchedules/PersonalScheduleEvent.js:112:53
           {style.height >= 40 && (
             <Card.Text
               data-testid={`${testId}-time`}
-              style={{ fontSize: "12px", textAlign: "left" }}
+              style={{ fontSize: "12px", textAlign: "" }}
             >
               {event.startTime} - {event.endTime}

[Survived] ObjectLiteral
main/components/PersonalSchedules/PersonalScheduleEvent.js:112:22
           {style.height >= 40 && (
             <Card.Text
               data-testid={`${testId}-time`}
-              style={{ fontSize: "12px", textAlign: "left" }}
+              style={{}}
             >
               {event.startTime} - {event.endTime}
