[Killed] StringLiteral
main/components/PersonalSchedules/PersonalSchedulePanel.js:10:3
   "Tuesday",
   "Wednesday",
   "Thursday",
-  "Friday",
+  "",
   "Saturday",
   "Sunday",
killedBy: PersonalSchedulePanel tests renders without crashing and displays day and time headers
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchedulerPanel-Friday-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container-fluid"
      style="background-color: rgb(255, 255, 255); padding: 20px;"

[Killed] StringLiteral
main/components/PersonalSchedules/PersonalSchedulePanel.js:19:3
   "",
   "1 AM",
   "2 AM",
-  "3 AM",
+  "",
   "4 AM",
   "5 AM",
killedBy: PersonalSchedulePanel tests renders without crashing and displays day and time headers
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchedulerPanel-3-AM-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container-fluid"
      style="background-color: rgb(255, 255, 255); padding: 20px;"

[Killed] StringLiteral
main/components/PersonalSchedules/PersonalSchedulePanel.js:24:3
   "5 AM",
   "6 AM",
   "7 AM",
-  "8 AM",
+  "",
   "9 AM",
   "10 AM",
killedBy: PersonalSchedulePanel tests renders without crashing and displays day and time headers
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchedulerPanel-8-AM-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container-fluid"
      style="background-color: rgb(255, 255, 255); padding: 20px;"

[Killed] StringLiteral
main/components/PersonalSchedules/PersonalSchedulePanel.js:25:3
   "6 AM",
   "7 AM",
   "8 AM",
-  "9 AM",
+  "",
   "10 AM",
   "11 AM",
killedBy: PersonalSchedulePanel tests renders without crashing and displays day and time headers
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchedulerPanel-9-AM-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container-fluid"
      style="background-color: rgb(255, 255, 255); padding: 20px;"

[Killed] StringLiteral
main/components/PersonalSchedules/PersonalSchedulePanel.js:33:3
   "2 PM",
   "3 PM",
   "4 PM",
-  "5 PM",
+  "",
   "6 PM",
   "7 PM",
killedBy: PersonalSchedulePanel tests renders without crashing and displays day and time headers
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchedulerPanel-5-PM-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container-fluid"
      style="background-color: rgb(255, 255, 255); padding: 20px;"

[Killed] StringLiteral
main/components/PersonalSchedules/PersonalSchedulePanel.js:34:3
   "3 PM",
   "4 PM",
   "5 PM",
-  "6 PM",
+  "",
   "7 PM",
   "8 PM",
killedBy: PersonalSchedulePanel tests renders without crashing and displays day and time headers
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchedulerPanel-6-PM-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container-fluid"
      style="background-color: rgb(255, 255, 255); padding: 20px;"

[Survived] StringLiteral
main/components/PersonalSchedules/PersonalSchedulePanel.js:53:16
 // Stryker disable next-line all : no need to test default colors
 export default function SchedulerPanel({
   Events = [],
-  eventColor = "#d1ecf188",
+  eventColor = "",
   borderColor = "#bee5eb",
 }) {

[Survived] StringLiteral
main/components/PersonalSchedules/PersonalSchedulePanel.js:54:17
 export default function SchedulerPanel({
   Events = [],
   eventColor = "#d1ecf188",
-  borderColor = "#bee5eb",
+  borderColor = "",
 }) {
   const testId = "SchedulerPanel";

[Killed] ArrowFunction
main/components/PersonalSchedules/PersonalSchedulePanel.js:77:64
                   {day}
                 </Card.Title>
               </Card.Body>
-              {Events.filter((event) => event.day === day).map((event) => (
-                <SchedulerEvents
-                  key={event.id}
-                  event={event}
-                  eventColor={eventColor}
-                  borderColor={borderColor}
-                />
-              ))}
+              {Events.filter((event) => event.day === day).map(() => undefined)}
             </Card>
           </Col>
killedBy: PersonalSchedulesWeeklyViewPage tests shows the correct info for admin users
statusReason: Error: Unable to find an element with the text: ECE 1A (0100). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/components/PersonalSchedules/PersonalSchedulePanel.js:77:41
                   {day}
                 </Card.Title>
               </Card.Body>
-              {Events.filter((event) => event.day === day).map((event) => (
+              {Events.filter((event) => true).map((event) => (
                 <SchedulerEvents
                   key={event.id}
killedBy: PersonalSchedulePanel tests renders events correctly when Events prop is provided
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="SchedulerEvent-event1-Monday"]

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  class="card"
  data-testid="SchedulerEvent-event1-Monday"

[Survived] StringLiteral
main/components/PersonalSchedules/PersonalSchedulePanel.js:94:52
           {
             /* Stryker disable next-line all : no test needed for styling */
             <div
-              style={{ ...styles.timeSlot, height: "30px", border: "0" }}
+              style={{ ...styles.timeSlot, height: "", border: "0" }}
             ></div>
           }

[Survived] StringLiteral
main/components/PersonalSchedules/PersonalSchedulePanel.js:94:68
           {
             /* Stryker disable next-line all : no test needed for styling */
             <div
-              style={{ ...styles.timeSlot, height: "30px", border: "0" }}
+              style={{ ...styles.timeSlot, height: "30px", border: "" }}
             ></div>
           }

[Killed] ArrowFunction
main/components/PersonalSchedules/PersonalSchedulePanel.js:97:22
               style={{ ...styles.timeSlot, height: "30px", border: "0" }}
             ></div>
           }
-          {hours.map((hour, index) => (
-            /* Stryker disable next-line all : no test needed for styling */
-            <div
-              key={index}
-              style={{ ...styles.timeSlot, border: "0" }}
-              data-testid={`${testId}-${hour.replace(" ", "-")}-title`}
-            >
-              <span
-                style={styles.hourLabel}
-                data-testid={`${testId}-${hour.replace(" ", "-")}-label`}
-              >
-                {hour}
-              </span>
-            </div>
-          ))}
+          {hours.map(() => undefined)}
         </Col>
         {daysOfWeek.map((day) => (
killedBy: PersonalSchedulesWeeklyViewPage tests shows the correct info for admin users
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchedulerPanel-8-AM-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Survived] ObjectLiteral
main/components/PersonalSchedules/PersonalSchedulePanel.js:101:22
             /* Stryker disable next-line all : no test needed for styling */
             <div
               key={index}
-              style={{ ...styles.timeSlot, border: "0" }}
+              style={{}}
               data-testid={`${testId}-${hour.replace(" ", "-")}-title`}
             >

[Killed] StringLiteral
main/components/PersonalSchedules/PersonalSchedulePanel.js:102:59
             <div
               key={index}
               style={{ ...styles.timeSlot, border: "0" }}
-              data-testid={`${testId}-${hour.replace(" ", "-")}-title`}
+              data-testid={`${testId}-${hour.replace(" ", "")}-title`}
             >
               <span
killedBy: PersonalSchedulePanel tests renders without crashing and displays day and time headers
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchedulerPanel-1-AM-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container-fluid"
      style="background-color: rgb(255, 255, 255); padding: 20px;"

[Killed] StringLiteral
main/components/PersonalSchedules/PersonalSchedulePanel.js:102:54
             <div
               key={index}
               style={{ ...styles.timeSlot, border: "0" }}
-              data-testid={`${testId}-${hour.replace(" ", "-")}-title`}
+              data-testid={`${testId}-${hour.replace("", "-")}-title`}
             >
               <span
killedBy: PersonalSchedulesWeeklyViewPage tests shows the correct info for admin users
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchedulerPanel-8-AM-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Survived] ArrowFunction
main/components/PersonalSchedules/PersonalSchedulePanel.js:113:25
             </div>
           ))}
         </Col>
-        {daysOfWeek.map((day) => (
-          <Col key={day} style={styles.dayColumn}>
-            {
-              /* Stryker disable next-line all : no test needed for styling */
-              <div style={{ ...styles.timeSlot, height: "30px" }}></div>
-            }
-            {hours.slice(0, hours.length - 1).map((hour) => (
-              <div
-                key={hour}
-                style={styles.timeSlot}
-                data-testid={`${testId}-base-slot`}
-              >
-                <Card style={styles.eventCard} />
-              </div>
-            ))}
-          </Col>
-        ))}
+        {daysOfWeek.map(() => undefined)}
       </Row>
     </Container>

[Survived] MethodExpression
main/components/PersonalSchedules/PersonalSchedulePanel.js:119:14
               /* Stryker disable next-line all : no test needed for styling */
               <div style={{ ...styles.timeSlot, height: "30px" }}></div>
             }
-            {hours.slice(0, hours.length - 1).map((hour) => (
+            {hours.map((hour) => (
               <div
                 key={hour}

[Survived] ArrowFunction
main/components/PersonalSchedules/PersonalSchedulePanel.js:119:51
               /* Stryker disable next-line all : no test needed for styling */
               <div style={{ ...styles.timeSlot, height: "30px" }}></div>
             }
-            {hours.slice(0, hours.length - 1).map((hour) => (
-              <div
-                key={hour}
-                style={styles.timeSlot}
-                data-testid={`${testId}-base-slot`}
-              >
-                <Card style={styles.eventCard} />
-              </div>
-            ))}
+            {hours.slice(0, hours.length - 1).map(() => undefined)}
           </Col>
         ))}

[Survived] StringLiteral
main/components/PersonalSchedules/PersonalSchedulePanel.js:123:30
               <div
                 key={hour}
                 style={styles.timeSlot}
-                data-testid={`${testId}-base-slot`}
+                data-testid={``}
               >
                 <Card style={styles.eventCard} />
