[Killed] BlockStatement
main/pages/PersonalSchedules/PersonalSchedulesWeeklyViewPage.js:9:36
 import { Button, Row, Col } from "react-bootstrap";
 
 // Helper function to convert HH:MM (24-hour) to h:MM AM/PM format
-const formatTime = (timeString) => {
-  if (!timeString) return "";
-  const [hours, minutes] = timeString.split(":");
-  const hoursInt = parseInt(hours, 10);
-  const ampm = hoursInt >= 12 ? "PM" : "AM";
-  const formattedHours = hoursInt % 12 || 12; // Convert 0 or 12 to 12
-  return `${formattedHours}:${minutes} ${ampm}`;
-};
+const formatTime = (timeString) => {};
 
 // Helper function to parse days string (e.g., " T R  ") into an array of day names
killedBy: PersonalSchedulesWeeklyViewPage tests shows the correct info for admin users
statusReason: TypeError: Cannot read properties of undefined (reading 'slice')

[Killed] BooleanLiteral
main/pages/PersonalSchedules/PersonalSchedulesWeeklyViewPage.js:10:7
 
 // Helper function to convert HH:MM (24-hour) to h:MM AM/PM format
 const formatTime = (timeString) => {
-  if (!timeString) return "";
+  if (timeString) return "";
   const [hours, minutes] = timeString.split(":");
   const hoursInt = parseInt(hours, 10);
killedBy: PersonalSchedulesWeeklyViewPage tests shows the correct info for admin users
statusReason: Error: Unable to find an element with the text: ECE 1A (0100). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/PersonalSchedules/PersonalSchedulesWeeklyViewPage.js:10:7
 
 // Helper function to convert HH:MM (24-hour) to h:MM AM/PM format
 const formatTime = (timeString) => {
-  if (!timeString) return "";
+  if (true) return "";
   const [hours, minutes] = timeString.split(":");
   const hoursInt = parseInt(hours, 10);
killedBy: PersonalSchedulesWeeklyViewPage tests shows the correct info for admin users
statusReason: Error: Unable to find an element with the text: ECE 1A (0100). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/PersonalSchedules/PersonalSchedulesWeeklyViewPage.js:11:45
 // Helper function to convert HH:MM (24-hour) to h:MM AM/PM format
 const formatTime = (timeString) => {
   if (!timeString) return "";
-  const [hours, minutes] = timeString.split(":");
+  const [hours, minutes] = timeString.split("");
   const hoursInt = parseInt(hours, 10);
   const ampm = hoursInt >= 12 ? "PM" : "AM";
killedBy: PersonalSchedulesWeeklyViewPage tests shows the correct info for admin users
statusReason: Error: Unable to find an element with the text: ECE 1A (0100). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Survived] EqualityOperator
main/pages/PersonalSchedules/PersonalSchedulesWeeklyViewPage.js:13:16
   if (!timeString) return "";
   const [hours, minutes] = timeString.split(":");
   const hoursInt = parseInt(hours, 10);
-  const ampm = hoursInt >= 12 ? "PM" : "AM";
+  const ampm = hoursInt < 12 ? "PM" : "AM";
   const formattedHours = hoursInt % 12 || 12; // Convert 0 or 12 to 12
   return `${formattedHours}:${minutes} ${ampm}`;

[Survived] EqualityOperator
main/pages/PersonalSchedules/PersonalSchedulesWeeklyViewPage.js:13:16
   if (!timeString) return "";
   const [hours, minutes] = timeString.split(":");
   const hoursInt = parseInt(hours, 10);
-  const ampm = hoursInt >= 12 ? "PM" : "AM";
+  const ampm = hoursInt > 12 ? "PM" : "AM";
   const formattedHours = hoursInt % 12 || 12; // Convert 0 or 12 to 12
   return `${formattedHours}:${minutes} ${ampm}`;

[Killed] ConditionalExpression
main/pages/PersonalSchedules/PersonalSchedulesWeeklyViewPage.js:14:26
   const [hours, minutes] = timeString.split(":");
   const hoursInt = parseInt(hours, 10);
   const ampm = hoursInt >= 12 ? "PM" : "AM";
-  const formattedHours = hoursInt % 12 || 12; // Convert 0 or 12 to 12
+  const formattedHours = true; // Convert 0 or 12 to 12
   return `${formattedHours}:${minutes} ${ampm}`;
 };
killedBy: PersonalSchedulesWeeklyViewPage tests shows the correct info for admin users
statusReason: Error: Unable to find an element with the text: ECE 1A (0100). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/PersonalSchedules/PersonalSchedulesWeeklyViewPage.js:14:26
   const [hours, minutes] = timeString.split(":");
   const hoursInt = parseInt(hours, 10);
   const ampm = hoursInt >= 12 ? "PM" : "AM";
-  const formattedHours = hoursInt % 12 || 12; // Convert 0 or 12 to 12
+  const formattedHours = false; // Convert 0 or 12 to 12
   return `${formattedHours}:${minutes} ${ampm}`;
 };
killedBy: PersonalSchedulesWeeklyViewPage tests shows the correct info for admin users
statusReason: Error: Unable to find an element with the text: ECE 1A (0100). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/PersonalSchedules/PersonalSchedulesWeeklyViewPage.js:15:10
   const hoursInt = parseInt(hours, 10);
   const ampm = hoursInt >= 12 ? "PM" : "AM";
   const formattedHours = hoursInt % 12 || 12; // Convert 0 or 12 to 12
-  return `${formattedHours}:${minutes} ${ampm}`;
+  return ``;
 };
 
killedBy: PersonalSchedulesWeeklyViewPage tests shows the correct info for admin users
statusReason: Error: Unable to find an element with the text: ECE 1A (0100). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/PersonalSchedules/PersonalSchedulesWeeklyViewPage.js:19:33
 };
 
 // Helper function to parse days string (e.g., " T R  ") into an array of day names
-const mapDays = (daysString) => {
-  if (!daysString) return [];
-  const dayMapping = {
-    M: "Monday",
-    T: "Tuesday",
-    W: "Wednesday",
-    R: "Thursday",
-    F: "Friday",
-    S: "Saturday",
-    U: "Sunday",
-  };
-  const activeDays = [];
-  for (let i = 0; i < daysString.length; i++) {
-    const char = daysString[i];
-    if (dayMapping[char]) {
-      activeDays.push(dayMapping[char]);
-    }
-  }
-  return activeDays;
-};
+const mapDays = (daysString) => {};
 
 export default function PersonalSchedulesWeeklyViewPage() {
killedBy: PersonalSchedulesWeeklyViewPage tests shows the correct info for admin users
statusReason: TypeError: Cannot read properties of undefined (reading 'forEach')

[Killed] ConditionalExpression
main/pages/PersonalSchedules/PersonalSchedulesWeeklyViewPage.js:20:7
 
 // Helper function to parse days string (e.g., " T R  ") into an array of day names
 const mapDays = (daysString) => {
-  if (!daysString) return [];
+  if (true) return [];
   const dayMapping = {
     M: "Monday",
killedBy: PersonalSchedulesWeeklyViewPage tests shows the correct info for admin users
statusReason: Error: Unable to find an element with the text: ECE 1A (0100). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
main/pages/PersonalSchedules/PersonalSchedulesWeeklyViewPage.js:20:7
 
 // Helper function to parse days string (e.g., " T R  ") into an array of day names
 const mapDays = (daysString) => {
-  if (!daysString) return [];
+  if (daysString) return [];
   const dayMapping = {
     M: "Monday",
killedBy: PersonalSchedulesWeeklyViewPage tests shows the correct info for admin users
statusReason: Error: Unable to find an element with the text: ECE 1A (0100). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/PersonalSchedules/PersonalSchedulesWeeklyViewPage.js:31:19
     U: "Sunday",
   };
   const activeDays = [];
-  for (let i = 0; i < daysString.length; i++) {
+  for (let i = 0; false; i++) {
     const char = daysString[i];
     if (dayMapping[char]) {
killedBy: PersonalSchedulesWeeklyViewPage tests shows the correct info for admin users
statusReason: Error: Unable to find an element with the text: ECE 1A (0100). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] EqualityOperator
main/pages/PersonalSchedules/PersonalSchedulesWeeklyViewPage.js:31:19
     U: "Sunday",
   };
   const activeDays = [];
-  for (let i = 0; i < daysString.length; i++) {
+  for (let i = 0; i >= daysString.length; i++) {
     const char = daysString[i];
     if (dayMapping[char]) {
killedBy: PersonalSchedulesWeeklyViewPage tests shows the correct info for admin users
statusReason: Error: Unable to find an element with the text: ECE 1A (0100). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/PersonalSchedules/PersonalSchedulesWeeklyViewPage.js:33:9
   const activeDays = [];
   for (let i = 0; i < daysString.length; i++) {
     const char = daysString[i];
-    if (dayMapping[char]) {
+    if (false) {
       activeDays.push(dayMapping[char]);
     }
killedBy: PersonalSchedulesWeeklyViewPage tests shows the correct info for admin users
statusReason: Error: Unable to find an element with the text: ECE 1A (0100). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/PersonalSchedules/PersonalSchedulesWeeklyViewPage.js:33:27
   const activeDays = [];
   for (let i = 0; i < daysString.length; i++) {
     const char = daysString[i];
-    if (dayMapping[char]) {
-      activeDays.push(dayMapping[char]);
-    }
+    if (dayMapping[char]) {}
   }
   return activeDays;
killedBy: PersonalSchedulesWeeklyViewPage tests shows the correct info for admin users
statusReason: Error: Unable to find an element with the text: ECE 1A (0100). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
