[Killed] StringLiteral
main/components/Jobs/UpdateCoursesByQuarterJobForm.js:20:5
 
   const quarters = quarterRange(startQtr, endQtr);
   const storedQuarter = localStorage.getItem(
-    "UpdateCoursesByQuarterJobForm.Quarter",
+    "",
   );
   const initialQuarter = storedQuarter ?? quarters[0].yyyyq;
killedBy: UpdateCoursesByQuarterJobForm tests works when local storage has a value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "20193"
Received: "20191"

[Killed] LogicalOperator
main/components/Jobs/UpdateCoursesByQuarterJobForm.js:22:26
   const storedQuarter = localStorage.getItem(
     "UpdateCoursesByQuarterJobForm.Quarter",
   );
-  const initialQuarter = storedQuarter ?? quarters[0].yyyyq;
+  const initialQuarter = storedQuarter && quarters[0].yyyyq;
   const [quarter, setQuarter] = useState(initialQuarter);
   const [ifStale, setIfStale] = useState(true);
killedBy: UpdateCoursesByQuarterJobForm tests works when local storage has a value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "20193"
Received: "20191"

[Killed] BooleanLiteral
main/components/Jobs/UpdateCoursesByQuarterJobForm.js:24:42
   );
   const initialQuarter = storedQuarter ?? quarters[0].yyyyq;
   const [quarter, setQuarter] = useState(initialQuarter);
-  const [ifStale, setIfStale] = useState(true);
+  const [ifStale, setIfStale] = useState(false);
 
   const handleSubmit = (event) => {
killedBy: AdminJobsPage tests user can submit the update course data by quarter job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/api/jobs/launch/updateQuarterCourses?quarterYYYYQ=20222&ifStale=true"
Received: "/api/jobs/launch/updateQuarterCourses?quarterYYYYQ=20222&ifStale=false"

[Killed] BlockStatement
main/components/Jobs/UpdateCoursesByQuarterJobForm.js:26:35
   const [quarter, setQuarter] = useState(initialQuarter);
   const [ifStale, setIfStale] = useState(true);
 
-  const handleSubmit = (event) => {
-    event.preventDefault();
-    callback({ quarter, ifStale });
-  };
+  const handleSubmit = (event) => {};
 
   // Stryker disable all : Stryker is testing by changing the padding to 0. But this is simply a visual optimization as it makes it look better
killedBy: AdminJobsPage tests user can submit the update course data by quarter job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />
