[Killed] BlockStatement
main/components/Quarters/SingleQuarterDropdown.js:32:28
 
   const localSearchQuarter = localStorage.getItem(controlId);
 
-  if (!localSearchQuarter) {
-    localStorage.setItem(controlId, quarters[lastInd].yyyyq);
-  }
+  if (!localSearchQuarter) {}
 
   const [quarterState, setQuarterState] = useState(
killedBy: SingleQuarterSelector tests when localstorage has no value, last element of quarter range is the default parameter
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "sqd1", "20224"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
main/components/Quarters/SingleQuarterDropdown.js:46:27
     localStorage.setItem(controlId, selectedQuarter);
     setQuarterState(selectedQuarter);
     setQuarter(selectedQuarter);
-    if (onChange != null) {
-      onChange(event);
-    }
+    if (onChange != null) {}
   };
 
killedBy: SingleQuarterSelector tests if I pass a non-null onChange, it gets called when the value changes
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] LogicalOperator
main/components/Quarters/SingleQuarterDropdown.js:60:10
         value={quarterState}
         onChange={handleQuarterOnChange}
       >
-        {showAll && (
-          <option data-testid={`${controlId}-option-all`} value="ALL">
-            ALL
-          </option>
-        )}
+        {showAll || <option data-testid={`${controlId}-option-all`} value="ALL">
+            ALL
+          </option>}
         {quarters.map(function (object, i) {
           const key = `${controlId}-option-${i}`;
killedBy: SingleQuarterSelector tests renders "ALL" option when showAll is true
statusReason: Error: Unable to find an element by: [data-testid="sqd1-option-all"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="form-label"
