[Killed] ArrowFunction
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.js:11:31
   // Stryker disable next-line all : Can't test state because hook is internal
   const [courseJSON, setCourseJSON] = useState([]);
 
-  const objectToAxiosParams = (query) => ({
-    url: "/api/public/courseovertime/buildingsearch",
-    params: {
-      startQtr: query.Quarter,
-      endQtr: query.Quarter,
-      buildingCode: query.buildingCode,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (buildings) => {
killedBy: CourseOverTimeBuildingsIndexPage tests calls UCSB Course over time search api correctly with correct response
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"buildingCode": "GIRV", "endQtr": "20222", "startQtr": "20222"}
Received: undefined

[Killed] StringLiteral
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.js:12:10
   const [courseJSON, setCourseJSON] = useState([]);
 
   const objectToAxiosParams = (query) => ({
-    url: "/api/public/courseovertime/buildingsearch",
+    url: "",
     params: {
       startQtr: query.Quarter,
killedBy: CourseOverTimeBuildingsIndexPage tests calls UCSB Course over time search api correctly with correct response
statusReason: TestingLibraryElementError: Unable to find an element with the text: text => text.includes("184"). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.js:20:36
     },
   });
 
-  const onSuccess = (buildings) => {
-    setCourseJSON(buildings);
-  };
+  const onSuccess = (buildings) => {};
 
   const mutation = useBackendMutation(
killedBy: CourseOverTimeBuildingsIndexPage tests calls UCSB Course over time search api correctly with correct response
statusReason: TestingLibraryElementError: Unable to find an element with the text: text => text.includes("184"). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] MethodExpression
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.js:43:21
           fetchJSON={fetchCourseOverTimeJSON}
         />
         <SectionsTable
-          sections={courseJSON.sort((a, b) =>
-            b.courseInfo.quarter.localeCompare(a.courseInfo.quarter),
-          )}
+          sections={courseJSON}
         />
       </div>
killedBy: CourseOverTimeBuildingsIndexPage tests calls UCSB Course over time search api correctly with correctly sorted data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Received
       1
          Object {
        -   "sections": Array [
        -     Object {

[Killed] ArrowFunction
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.js:43:37
           fetchJSON={fetchCourseOverTimeJSON}
         />
         <SectionsTable
-          sections={courseJSON.sort((a, b) =>
-            b.courseInfo.quarter.localeCompare(a.courseInfo.quarter),
+          sections={courseJSON.sort(() => undefined,
           )}
         />
killedBy: CourseOverTimeBuildingsIndexPage tests calls UCSB Course over time search api correctly with correctly sorted data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Received
       1
          Object {
        -   "sections": Array [
        -     Object {
