[Killed] LogicalOperator
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.js:16:20
   const { data: systemInfo } = useSystemInfo();
 
   // stryker-disable OptionalChaining
-  const startQtr = systemInfo?.startQtrYYYYQ ?? "20232";
+  const startQtr = systemInfo?.startQtrYYYYQ && "20232";
   const endQtr = systemInfo?.endQtrYYYYQ ?? "20254";
   // stryker-enable OptionalChaining
killedBy: CourseOverTimeBuildingsSearchForm tests does not fetch classrooms if Quarter or buildingCode is missing
statusReason: Error: param should be a string

[Killed] OptionalChaining
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.js:16:20
   const { data: systemInfo } = useSystemInfo();
 
   // stryker-disable OptionalChaining
-  const startQtr = systemInfo?.startQtrYYYYQ ?? "20232";
+  const startQtr = systemInfo.startQtrYYYYQ ?? "20232";
   const endQtr = systemInfo?.endQtrYYYYQ ?? "20254";
   // stryker-enable OptionalChaining
killedBy: CourseOverTimeBuildingsSearchForm tests falls back to default endQtr when systemInfo is undefined
statusReason: TypeError: Cannot read properties of undefined (reading 'startQtrYYYYQ')

[Killed] LogicalOperator
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.js:17:18
 
   // stryker-disable OptionalChaining
   const startQtr = systemInfo?.startQtrYYYYQ ?? "20232";
-  const endQtr = systemInfo?.endQtrYYYYQ ?? "20254";
+  const endQtr = systemInfo?.endQtrYYYYQ && "20254";
   // stryker-enable OptionalChaining
   const availableQuarters = quarterRange(startQtr, endQtr);
killedBy: CourseOverTimeBuildingsSearchForm tests does not fetch classrooms if Quarter or buildingCode is missing
statusReason: Error: param should be a string

[Killed] OptionalChaining
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.js:17:18
 
   // stryker-disable OptionalChaining
   const startQtr = systemInfo?.startQtrYYYYQ ?? "20232";
-  const endQtr = systemInfo?.endQtrYYYYQ ?? "20254";
+  const endQtr = systemInfo.endQtrYYYYQ ?? "20254";
   // stryker-enable OptionalChaining
   const availableQuarters = quarterRange(startQtr, endQtr);
killedBy: CourseOverTimeBuildingsSearchForm tests falls back to default endQtr when systemInfo is undefined
statusReason: TypeError: Cannot read properties of undefined (reading 'endQtrYYYYQ')

[Killed] StringLiteral
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.js:22:5
   const availableQuarters = quarterRange(startQtr, endQtr);
 
   const localQuarter = localStorage.getItem(
-    "CourseOverTimeBuildingsSearch.Quarter",
+    "",
   );
   const localBuildingCode = localStorage.getItem(
killedBy: CourseOverTimeBuildingsSearchForm tests logs classrooms when fetch is successful
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "Fetching classrooms with:", {"Quarter": "20222", "buildingCode": "PHELP"}
Received
       1
          "Fetching classrooms with:",
          Object {
        -   "Quarter": "20222",

[Killed] LogicalOperator
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.js:29:5
   );
 
   const [Quarter, setQuarter] = useState(
-    localQuarter || availableQuarters[0].yyyyq,
+    localQuarter && availableQuarters[0].yyyyq,
   );
   const [buildingCode, setBuildingCode] = useState(localBuildingCode || "");
killedBy: CourseOverTimeBuildingsSearchForm tests logs classrooms when fetch is successful
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "Fetching classrooms with:", {"Quarter": "20222", "buildingCode": "PHELP"}
Received
       1
          "Fetching classrooms with:",
          Object {
        -   "Quarter": "20222",

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.js:29:5
   );
 
   const [Quarter, setQuarter] = useState(
-    localQuarter || availableQuarters[0].yyyyq,
+    true,
   );
   const [buildingCode, setBuildingCode] = useState(localBuildingCode || "");
killedBy: CourseOverTimeBuildingsSearchForm tests logs classrooms when fetch is successful
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "Fetching classrooms with:", {"Quarter": "20222", "buildingCode": "PHELP"}
Received
       1
          "Fetching classrooms with:",
          Object {
        -   "Quarter": "20222",

[Killed] LogicalOperator
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.js:31:52
   const [Quarter, setQuarter] = useState(
     localQuarter || availableQuarters[0].yyyyq,
   );
-  const [buildingCode, setBuildingCode] = useState(localBuildingCode || "");
+  const [buildingCode, setBuildingCode] = useState(localBuildingCode && "");
   const [availableClassrooms, setAvailableClassrooms] = useState([]);
 
killedBy: CourseOverTimeBuildingsSearchForm tests fetches classrooms if both Quarter and buildingCode exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.js:31:52
   const [Quarter, setQuarter] = useState(
     localQuarter || availableQuarters[0].yyyyq,
   );
-  const [buildingCode, setBuildingCode] = useState(localBuildingCode || "");
+  const [buildingCode, setBuildingCode] = useState(false);
   const [availableClassrooms, setAvailableClassrooms] = useState([]);
 
killedBy: CourseOverTimeBuildingsSearchForm tests fetches classrooms if both Quarter and buildingCode exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ArrayDeclaration
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.js:32:66
     localQuarter || availableQuarters[0].yyyyq,
   );
   const [buildingCode, setBuildingCode] = useState(localBuildingCode || "");
-  const [availableClassrooms, setAvailableClassrooms] = useState([]);
+  const [availableClassrooms, setAvailableClassrooms] = useState(["Stryker was here"]);
 
   const handleSubmit = (event) => {
killedBy: CourseOverTimeBuildingsSearchForm tests fetches classrooms and displays them when quarter and building are selected
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  1004, 1106, 1108, 1112, 1115, 1116, 1119, 2108, 2110, 2112, 2115, 2116, 2119, 2120, 2123, 2124, 2127, 2128, 2129, 2135
Received:
  Stryker was here

[Killed] BlockStatement
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.js:34:35
   const [buildingCode, setBuildingCode] = useState(localBuildingCode || "");
   const [availableClassrooms, setAvailableClassrooms] = useState([]);
 
-  const handleSubmit = (event) => {
-    event.preventDefault();
-    fetchJSON(event, { Quarter, buildingCode, classroom: "" });
-  };
+  const handleSubmit = (event) => {};
 
   useEffect(() => {
killedBy: CourseOverTimeBuildingsSearchForm tests when I click submit, the right stuff happens
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.js:36:22
 
   const handleSubmit = (event) => {
     event.preventDefault();
-    fetchJSON(event, { Quarter, buildingCode, classroom: "" });
+    fetchJSON(event, {});
   };
 
killedBy: CourseOverTimeBuildingsSearchForm tests when I click submit, the right stuff happens
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "Quarter": "20232",

[Killed] BlockStatement
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.js:39:19
     fetchJSON(event, { Quarter, buildingCode, classroom: "" });
   };
 
-  useEffect(() => {
-    async function fetchClassrooms() {
-      if (Quarter && buildingCode) {
-        try {
-          console.log("Fetching classrooms with:", { Quarter, buildingCode });
-          const response = await axios.get(
-            "/api/public/courseovertime/buildingsearch/classrooms",
-            {
-              params: { quarter: Quarter, buildingCode },
-            },
-          );
-          console.log("Classrooms returned:", response.data);
-          const classrooms = response.data.sort();
-
-          setAvailableClassrooms(classrooms);
-        } catch (error) {
-          console.error("Error fetching classrooms", error);
-          setAvailableClassrooms([]);
-        }
-      }
-    }
-    fetchClassrooms();
-  }, [Quarter, buildingCode]);
+  useEffect(() => {}, [Quarter, buildingCode]);
 
   return (
killedBy: CourseOverTimeBuildingsSearchForm tests fetches classrooms and displays them when quarter and building are selected
statusReason: Error: Unable to find an element by: [data-testid="available-classrooms"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BlockStatement
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.js:40:38
   };
 
   useEffect(() => {
-    async function fetchClassrooms() {
-      if (Quarter && buildingCode) {
-        try {
-          console.log("Fetching classrooms with:", { Quarter, buildingCode });
-          const response = await axios.get(
-            "/api/public/courseovertime/buildingsearch/classrooms",
-            {
-              params: { quarter: Quarter, buildingCode },
-            },
-          );
-          console.log("Classrooms returned:", response.data);
-          const classrooms = response.data.sort();
-
-          setAvailableClassrooms(classrooms);
-        } catch (error) {
-          console.error("Error fetching classrooms", error);
-          setAvailableClassrooms([]);
-        }
-      }
-    }
+    async function fetchClassrooms() {}
     fetchClassrooms();
   }, [Quarter, buildingCode]);
killedBy: CourseOverTimeBuildingsSearchForm tests fetches classrooms and displays them when quarter and building are selected
statusReason: Error: Unable to find an element by: [data-testid="available-classrooms"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BlockStatement
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.js:41:36
 
   useEffect(() => {
     async function fetchClassrooms() {
-      if (Quarter && buildingCode) {
-        try {
-          console.log("Fetching classrooms with:", { Quarter, buildingCode });
-          const response = await axios.get(
-            "/api/public/courseovertime/buildingsearch/classrooms",
-            {
-              params: { quarter: Quarter, buildingCode },
-            },
-          );
-          console.log("Classrooms returned:", response.data);
-          const classrooms = response.data.sort();
-
-          setAvailableClassrooms(classrooms);
-        } catch (error) {
-          console.error("Error fetching classrooms", error);
-          setAvailableClassrooms([]);
-        }
-      }
+      if (Quarter && buildingCode) {}
     }
     fetchClassrooms();
killedBy: CourseOverTimeBuildingsSearchForm tests fetches classrooms and displays them when quarter and building are selected
statusReason: Error: Unable to find an element by: [data-testid="available-classrooms"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.js:41:11
 
   useEffect(() => {
     async function fetchClassrooms() {
-      if (Quarter && buildingCode) {
+      if (Quarter || buildingCode) {
         try {
           console.log("Fetching classrooms with:", { Quarter, buildingCode });
killedBy: CourseOverTimeBuildingsSearchForm tests does not fetch classrooms if Quarter or buildingCode is missing
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "/api/public/courseovertime/buildingsearch/classrooms", {"params": {"buildingCode": "", "quarter": "20232"}}

Ignored nodes: comments, script, style

[Killed] BlockStatement
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.js:42:13
   useEffect(() => {
     async function fetchClassrooms() {
       if (Quarter && buildingCode) {
-        try {
-          console.log("Fetching classrooms with:", { Quarter, buildingCode });
-          const response = await axios.get(
-            "/api/public/courseovertime/buildingsearch/classrooms",
-            {
-              params: { quarter: Quarter, buildingCode },
-            },
-          );
-          console.log("Classrooms returned:", response.data);
-          const classrooms = response.data.sort();
-
-          setAvailableClassrooms(classrooms);
-        } catch (error) {
+        try {} catch (error) {
           console.error("Error fetching classrooms", error);
           setAvailableClassrooms([]);
killedBy: CourseOverTimeBuildingsSearchForm tests fetches classrooms and displays them when quarter and building are selected
statusReason: Error: Unable to find an element by: [data-testid="available-classrooms"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.js:47:23
           const response = await axios.get(
             "/api/public/courseovertime/buildingsearch/classrooms",
             {
-              params: { quarter: Quarter, buildingCode },
+              params: {},
             },
           );
killedBy: CourseOverTimeBuildingsSearchForm tests fetches classrooms and displays them when quarter and building are selected
statusReason: Error: Unable to find an element by: [data-testid="available-classrooms"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.js:50:23
               params: { quarter: Quarter, buildingCode },
             },
           );
-          console.log("Classrooms returned:", response.data);
+          console.log("", response.data);
           const classrooms = response.data.sort();
 
killedBy: CourseOverTimeBuildingsSearchForm tests logs classrooms when fetch is successful
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "Classrooms returned:", Any<Array>
Received
       1: "Fetching classrooms with:", {"Quarter": "20222", "buildingCode": "PHELP"}
       2: "", ["CLSS1"]

Number of calls: 2

[Killed] MethodExpression
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.js:51:30
             },
           );
           console.log("Classrooms returned:", response.data);
-          const classrooms = response.data.sort();
+          const classrooms = response.data;
 
           setAvailableClassrooms(classrooms);
killedBy: CourseOverTimeBuildingsSearchForm tests fetches classrooms and displays them in sorted order
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  1004, 1106, 1108
Received:
  1108, 1004, 1106

[Killed] BlockStatement
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.js:54:25
           const classrooms = response.data.sort();
 
           setAvailableClassrooms(classrooms);
-        } catch (error) {
-          console.error("Error fetching classrooms", error);
-          setAvailableClassrooms([]);
-        }
+        } catch (error) {}
       }
     }
killedBy: CourseOverTimeBuildingsSearchForm tests displays no classrooms and logs error when fetch fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ArrayDeclaration
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.js:61:6
       }
     }
     fetchClassrooms();
-  }, [Quarter, buildingCode]);
+  }, []);
 
   return (
killedBy: CourseOverTimeBuildingsSearchForm tests fetches classrooms and displays them when quarter and building are selected
statusReason: Error: Unable to find an element by: [data-testid="available-classrooms"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.js:72:26
               quarters={availableQuarters}
               quarter={Quarter}
               setQuarter={setQuarter}
-              controlId={"CourseOverTimeBuildingsSearch.Quarter"}
+              controlId={""}
               label={"Quarter"}
             />
killedBy: CourseOverTimeBuildingsSearchForm tests when I select a quarter, the state for quarter changes
statusReason: TestingLibraryElementError: Found a label with the text of: Quarter, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.js:81:26
               buildings={allBuildings}
               building={buildingCode}
               setBuilding={setBuildingCode}
-              controlId={"CourseOverTimeBuildingsSearch.BuildingCode"}
+              controlId={""}
               label={"Building Name"}
             />
killedBy: CourseOverTimeBuildingsSearchForm tests when I select a building, the state for building changes
statusReason: Error: Unable to find an element by: [data-testid="CourseOverTimeBuildingsSearch.BuildingCode-option-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.js:93:10
             </Button>
           </Col>
         </Row>
-        {availableClassrooms.length > 0 && (
-          <div data-testid="available-classrooms">
-            {availableClassrooms.join(", ")}
-          </div>
-        )}
+        {false}
       </Container>
     </Form>
killedBy: CourseOverTimeBuildingsSearchForm tests fetches classrooms and displays them when quarter and building are selected
statusReason: Error: Unable to find an element by: [data-testid="available-classrooms"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.js:93:10
             </Button>
           </Col>
         </Row>
-        {availableClassrooms.length > 0 && (
-          <div data-testid="available-classrooms">
-            {availableClassrooms.join(", ")}
-          </div>
-        )}
+        {true}
       </Container>
     </Form>
killedBy: CourseOverTimeBuildingsSearchForm tests fetches classrooms and displays them when quarter and building are selected
statusReason: Error: Unable to find an element by: [data-testid="available-classrooms"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.js:95:39
         </Row>
         {availableClassrooms.length > 0 && (
           <div data-testid="available-classrooms">
-            {availableClassrooms.join(", ")}
+            {availableClassrooms.join("")}
           </div>
         )}
killedBy: CourseOverTimeBuildingsSearchForm tests fetches classrooms and displays them when quarter and building are selected
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  1004, 1106, 1108, 1112, 1115, 1116, 1119, 2108, 2110, 2112, 2115, 2116, 2119, 2120, 2123, 2124, 2127, 2128, 2129, 2135
Received:
  10041106110811121115111611192108211021122115211621192120212321242127212821292135
