[Killed] BlockStatement
main/components/Sections/SectionsTable.js:21:30
   renderInfoLink,
 } from "main/utils/sectionUtils.js";
 
-function getFirstVal(values) {
-  return values[0];
-}
+function getFirstVal(values) {}
 
 export function isLectureWithNoSections(enrollCode, sections) {
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  W22
Received:
  undefined

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.js:28:18
 export function isLectureWithNoSections(enrollCode, sections) {
   // Find the section with the given enrollCode
   const section = sections.find(
-    (section) => section.section.enrollCode === enrollCode,
+    (section) => false,
   );
 
killedBy: isLectureWithNoSections should return true when the section is a lecture with no other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
main/components/Sections/SectionsTable.js:28:18
 export function isLectureWithNoSections(enrollCode, sections) {
   // Find the section with the given enrollCode
   const section = sections.find(
-    (section) => section.section.enrollCode === enrollCode,
+    (section) => section.section.enrollCode !== enrollCode,
   );
 
killedBy: isLectureWithNoSections should return true when the section is a lecture with no other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.js:31:7
     (section) => section.section.enrollCode === enrollCode,
   );
 
-  if (section) {
+  if (true) {
     // Extract the courseId and section number from the found section
     const courseId = section.courseInfo.courseId;
killedBy: isLectureWithNoSections should return false when the section is not found
statusReason: TypeError: Cannot read properties of undefined (reading 'courseInfo')

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:31:16
     (section) => section.section.enrollCode === enrollCode,
   );
 
-  if (section) {
-    // Extract the courseId and section number from the found section
-    const courseId = section.courseInfo.courseId;
-    const sectionNumber = section.section.section;
-    const courseSections = sections.filter(
-      (section) => section.courseInfo.courseId === courseId,
-    );
-    const timeLocations = section.section.timeLocations;
-
-    // Check if the section number is '0100', indicating a lecture
-    if (sectionNumber === "0100") {
-      // Filter all sections with the same courseId
-      // Stryker disable all
-      // Stryker restore all
-      // Check if there is only one section for the course
-      return courseSections.length === 1;
-    } else if (sectionNumber.slice(-2) === "00") {
-      // Check if the section has a location to make sure its a course
-      return (
-        courseSections.length === 1 &&
-        typeof timeLocations !== "undefined" &&
-        timeLocations.length === 1
-      );
-    }
-  }
+  if (section) {}
 
   return false;
killedBy: isLectureWithNoSections should return true when the section is a lecture with no other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
main/components/Sections/SectionsTable.js:35:28
     // Extract the courseId and section number from the found section
     const courseId = section.courseInfo.courseId;
     const sectionNumber = section.section.section;
-    const courseSections = sections.filter(
-      (section) => section.courseInfo.courseId === courseId,
-    );
+    const courseSections = sections;
     const timeLocations = section.section.timeLocations;
 
killedBy: isLectureWithNoSections should return true when the section number ends in 00 and is not 0100 and has a location
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
main/components/Sections/SectionsTable.js:36:20
     const courseId = section.courseInfo.courseId;
     const sectionNumber = section.section.section;
     const courseSections = sections.filter(
-      (section) => section.courseInfo.courseId === courseId,
+      (section) => section.courseInfo.courseId !== courseId,
     );
     const timeLocations = section.section.timeLocations;
killedBy: isLectureWithNoSections should return true when the section is a lecture with no other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
main/components/Sections/SectionsTable.js:36:7
     const courseId = section.courseInfo.courseId;
     const sectionNumber = section.section.section;
     const courseSections = sections.filter(
-      (section) => section.courseInfo.courseId === courseId,
+      () => undefined,
     );
     const timeLocations = section.section.timeLocations;
killedBy: isLectureWithNoSections should return true when the section is a lecture with no other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.js:41:9
     const timeLocations = section.section.timeLocations;
 
     // Check if the section number is '0100', indicating a lecture
-    if (sectionNumber === "0100") {
+    if (false) {
       // Filter all sections with the same courseId
       // Stryker disable all
killedBy: isLectureWithNoSections should return true when the section is a lecture with no other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:41:35
     const timeLocations = section.section.timeLocations;
 
     // Check if the section number is '0100', indicating a lecture
-    if (sectionNumber === "0100") {
-      // Filter all sections with the same courseId
-      // Stryker disable all
-      // Stryker restore all
-      // Check if there is only one section for the course
-      return courseSections.length === 1;
-    } else if (sectionNumber.slice(-2) === "00") {
+    if (sectionNumber === "0100") {} else if (sectionNumber.slice(-2) === "00") {
       // Check if the section has a location to make sure its a course
       return (
killedBy: isLectureWithNoSections should return true when the section is a lecture with no other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.js:46:14
       // Stryker disable all
       // Stryker restore all
       // Check if there is only one section for the course
-      return courseSections.length === 1;
+      return true;
     } else if (sectionNumber.slice(-2) === "00") {
       // Check if the section has a location to make sure its a course
killedBy: isLectureWithNoSections should return false when the section is a lecture but there are other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.js:46:14
       // Stryker disable all
       // Stryker restore all
       // Check if there is only one section for the course
-      return courseSections.length === 1;
+      return false;
     } else if (sectionNumber.slice(-2) === "00") {
       // Check if the section has a location to make sure its a course
killedBy: isLectureWithNoSections should return true when the section is a lecture with no other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.js:47:16
       // Stryker restore all
       // Check if there is only one section for the course
       return courseSections.length === 1;
-    } else if (sectionNumber.slice(-2) === "00") {
+    } else if (true) {
       // Check if the section has a location to make sure its a course
       return (
killedBy: isLectureWithNoSections should return false when the section number does not end in 00
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] UnaryOperator
main/components/Sections/SectionsTable.js:47:36
       // Stryker restore all
       // Check if there is only one section for the course
       return courseSections.length === 1;
-    } else if (sectionNumber.slice(-2) === "00") {
+    } else if (sectionNumber.slice(+2) === "00") {
       // Check if the section has a location to make sure its a course
       return (
killedBy: isLectureWithNoSections should return true when the section number ends in 00 and is not 0100 and has a location
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
main/components/Sections/SectionsTable.js:50:9
     } else if (sectionNumber.slice(-2) === "00") {
       // Check if the section has a location to make sure its a course
       return (
-        courseSections.length === 1 &&
+        courseSections.length !== 1 &&
         typeof timeLocations !== "undefined" &&
         timeLocations.length === 1
killedBy: isLectureWithNoSections should return true when the section number ends in 00 and is not 0100 and has a location
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.js:50:9
     } else if (sectionNumber.slice(-2) === "00") {
       // Check if the section has a location to make sure its a course
       return (
-        courseSections.length === 1 &&
-        typeof timeLocations !== "undefined" &&
-        timeLocations.length === 1
+        false
       );
     }
killedBy: isLectureWithNoSections should return true when the section number ends in 00 and is not 0100 and has a location
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
main/components/Sections/SectionsTable.js:51:9
       // Check if the section has a location to make sure its a course
       return (
         courseSections.length === 1 &&
-        typeof timeLocations !== "undefined" &&
+        typeof timeLocations === "undefined" &&
         timeLocations.length === 1
       );
killedBy: isLectureWithNoSections should return true when the section number ends in 00 and is not 0100 and has a location
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.js:51:9
       // Check if the section has a location to make sure its a course
       return (
         courseSections.length === 1 &&
-        typeof timeLocations !== "undefined" &&
+        true &&
         timeLocations.length === 1
       );
killedBy: isLectureWithNoSections should return false when the section number ends in 00 and is not 0100 and does not have a location
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.js:52:9
       return (
         courseSections.length === 1 &&
         typeof timeLocations !== "undefined" &&
-        timeLocations.length === 1
+        true
       );
     }
killedBy: isLectureWithNoSections should return false when the section number ends in 00 and is not 0100 and has time locations not equal to one
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
main/components/Sections/SectionsTable.js:52:9
       return (
         courseSections.length === 1 &&
         typeof timeLocations !== "undefined" &&
-        timeLocations.length === 1
+        timeLocations.length !== 1
       );
     }
killedBy: isLectureWithNoSections should return true when the section number ends in 00 and is not 0100 and has a location
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:59:61
 
   return false;
 }
-export function isLectureWithSections(enrollCode, sections) {
-  // Find the section with the given enrollCode
-  const section = sections.find(
-    (section) => section.section.enrollCode === enrollCode,
-  );
-
-  if (section) {
-    // Extract the courseId and section number from the found section
-    const courseId = section.courseInfo.courseId;
-    const sectionNumberEnd = section.section.section.slice(2);
-
-    if (sectionNumberEnd === "00") {
-      // Filter all sections with the same courseId
-      // Stryker disable all
-      const courseSections = sections.filter(
-        (section) => section.courseInfo.courseId === courseId,
-      );
-      // Stryker restore all
-      // Check if there is only one section for the course
-      return courseSections.length > 1;
-    }
-  }
-
-  return false;
-}
+export function isLectureWithSections(enrollCode, sections) {}
 
 export const objectToAxiosParams = (data) => {
killedBy: isLectureWithSections should return false when the section is a lecture with no other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.js:62:18
 export function isLectureWithSections(enrollCode, sections) {
   // Find the section with the given enrollCode
   const section = sections.find(
-    (section) => section.section.enrollCode === enrollCode,
+    (section) => true,
   );
 
killedBy: isLectureWithSections should return false when the section is not found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:65:16
     (section) => section.section.enrollCode === enrollCode,
   );
 
-  if (section) {
-    // Extract the courseId and section number from the found section
-    const courseId = section.courseInfo.courseId;
-    const sectionNumberEnd = section.section.section.slice(2);
-
-    if (sectionNumberEnd === "00") {
-      // Filter all sections with the same courseId
-      // Stryker disable all
-      const courseSections = sections.filter(
-        (section) => section.courseInfo.courseId === courseId,
-      );
-      // Stryker restore all
-      // Check if there is only one section for the course
-      return courseSections.length > 1;
-    }
-  }
+  if (section) {}
 
   return false;
killedBy: isLectureWithSections should return true when the section is a lecture but there are other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
main/components/Sections/SectionsTable.js:68:30
   if (section) {
     // Extract the courseId and section number from the found section
     const courseId = section.courseInfo.courseId;
-    const sectionNumberEnd = section.section.section.slice(2);
+    const sectionNumberEnd = section.section.section;
 
     if (sectionNumberEnd === "00") {
killedBy: isLectureWithSections should return true when the section is a lecture but there are other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:70:36
     const courseId = section.courseInfo.courseId;
     const sectionNumberEnd = section.section.section.slice(2);
 
-    if (sectionNumberEnd === "00") {
-      // Filter all sections with the same courseId
-      // Stryker disable all
-      const courseSections = sections.filter(
-        (section) => section.courseInfo.courseId === courseId,
-      );
-      // Stryker restore all
-      // Check if there is only one section for the course
-      return courseSections.length > 1;
-    }
+    if (sectionNumberEnd === "00") {}
   }
 
killedBy: isLectureWithSections should return true when the section is a lecture but there are other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
main/components/Sections/SectionsTable.js:70:9
     const courseId = section.courseInfo.courseId;
     const sectionNumberEnd = section.section.section.slice(2);
 
-    if (sectionNumberEnd === "00") {
+    if (sectionNumberEnd !== "00") {
       // Filter all sections with the same courseId
       // Stryker disable all
killedBy: isLectureWithSections should return true when the section is a lecture but there are other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.js:78:14
       );
       // Stryker restore all
       // Check if there is only one section for the course
-      return courseSections.length > 1;
+      return false;
     }
   }
killedBy: isLectureWithSections should return true when the section is a lecture but there are other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
main/components/Sections/SectionsTable.js:78:14
       );
       // Stryker restore all
       // Check if there is only one section for the course
-      return courseSections.length > 1;
+      return courseSections.length >= 1;
     }
   }
killedBy: isLectureWithSections should return false when the section is a lecture with no other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:85:46
   return false;
 }
 
-export const objectToAxiosParams = (data) => {
-  return {
-    url: "/api/courses/post",
-    method: "POST",
-    params: {
-      enrollCd: data.enrollCd.toString(),
-      psId: data.psId.toString(),
-    },
-  };
-};
+export const objectToAxiosParams = (data) => {};
 
 export const handleAddToSchedule = (section, schedule, mutation) => {
killedBy: objectToAxiosParams should return the correct axios parameters
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"method": "POST", "params": {"enrollCd": "12345", "psId": "15"}, "url": "/api/courses/post"}
Received: undefined

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:96:69
   };
 };
 
-export const handleAddToSchedule = (section, schedule, mutation) => {
-  // Execute the mutation with the provided data
-  const dataFinal = {
-    enrollCd: section.section.enrollCode,
-    psId: schedule,
-  };
-  mutation.mutate(dataFinal);
-};
+export const handleAddToSchedule = (section, schedule, mutation) => {};
 
 export const handleLectureAddToSchedule = (section, schedule, mutation) => {
killedBy: handleAddToSchedule calls mutate with correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"enrollCd": "123", "psId": "456"}

Number of calls: 0

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:105:76
   mutation.mutate(dataFinal);
 };
 
-export const handleLectureAddToSchedule = (section, schedule, mutation) => {
-  // Execute the mutation with the provided data
-  console.log(section);
-  const dataFinal = {
-    enrollCd: section,
-    psId: schedule,
-  };
-  console.log(dataFinal);
-  mutation.mutate(dataFinal);
-};
+export const handleLectureAddToSchedule = (section, schedule, mutation) => {};
 
 export const onSuccess = (response) => {
killedBy: handleLectureAddToSchedule should execute the mutation with the provided data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"enrollCd": 12345, "psId": "FALL2023"}

Number of calls: 0

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:116:40
   mutation.mutate(dataFinal);
 };
 
-export const onSuccess = (response) => {
-  if (response.length < 3) {
-    toast(
-      `New course Created - id: ${response[0].id} enrollCd: ${response[0].enrollCd}`,
-    );
-  } else {
-    toast(
-      `Course ${response[0].enrollCd} replaced old section ${response[2].enrollCd} with new section ${response[1].enrollCd}`,
-    );
-  }
-};
+export const onSuccess = (response) => {};
 
 export const onError = (error) => {
killedBy: Section tests calls onSuccess when mutation is successful and calls toast with correct parameters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New course Created - id: 1 enrollCd: 1234"

Number of calls: 0

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.js:117:7
 };
 
 export const onSuccess = (response) => {
-  if (response.length < 3) {
+  if (true) {
     toast(
       `New course Created - id: ${response[0].id} enrollCd: ${response[0].enrollCd}`,
killedBy: Section tests calls onSuccess when mutation is successful for replacement and calls toasy with correct parameters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Course 1234 replaced old section 9012 with new section 5678"
Received: "New course Created - id: 1 enrollCd: 1234"

Number of calls: 1

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.js:117:7
 };
 
 export const onSuccess = (response) => {
-  if (response.length < 3) {
+  if (false) {
     toast(
       `New course Created - id: ${response[0].id} enrollCd: ${response[0].enrollCd}`,
killedBy: Section tests calls onSuccess when mutation is successful and calls toast with correct parameters
statusReason: TypeError: Cannot read properties of undefined (reading 'enrollCd')

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:121:10
     toast(
       `New course Created - id: ${response[0].id} enrollCd: ${response[0].enrollCd}`,
     );
-  } else {
-    toast(
-      `Course ${response[0].enrollCd} replaced old section ${response[2].enrollCd} with new section ${response[1].enrollCd}`,
-    );
-  }
+  } else {}
 };
 
killedBy: Section tests calls onSuccess when mutation is successful for replacement and calls toasy with correct parameters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Course 1234 replaced old section 9012 with new section 5678"

Number of calls: 0

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:128:35
   }
 };
 
-export const onError = (error) => {
-  const message =
-    error.response?.data?.message || "An unexpected error occurred";
-  toast.error(message);
-};
+export const onError = (error) => {};
 
 export default function SectionsTable({ sections }) {
killedBy: Section tests calls onError when mutation throws an error and calls toast with correct parameters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "class exists in schedule"

Number of calls: 0

[Killed] OptionalChaining
main/components/Sections/SectionsTable.js:130:5
 
 export const onError = (error) => {
   const message =
-    error.response?.data?.message || "An unexpected error occurred";
+    error.response.data?.message || "An unexpected error occurred";
   toast.error(message);
 };
killedBy: Section tests when error is received from backend, toast message error is displayed correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'data')

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.js:130:5
 
 export const onError = (error) => {
   const message =
-    error.response?.data?.message || "An unexpected error occurred";
+    true;
   toast.error(message);
 };
killedBy: Section tests calls onError when mutation throws an error and calls toast with correct parameters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "class exists in schedule"
Received: true

Number of calls: 1

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.js:147:5
   );
 
   const columns = [
-    {
-      Header: "Quarter",
-      accessor: (row) => yyyyqToQyy(row.courseInfo.quarter),
-      disableGroupBy: true,
-      id: "quarter",
-
-      aggregate: getFirstVal,
-      Aggregated: ({ cell: { value } }) => `${value}`,
-    },
+    {},
     {
       Header: "Course ID",
killedBy: Section tests calls onSuccess when mutation is successful and calls toast with correct parameters
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Sections/SectionsTable.js:149:17
   const columns = [
     {
       Header: "Quarter",
-      accessor: (row) => yyyyqToQyy(row.courseInfo.quarter),
+      accessor: () => undefined,
       disableGroupBy: true,
       id: "quarter",
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  W22
Received:
  undefined

[Killed] ArrowFunction
main/components/Sections/SectionsTable.js:154:19
       id: "quarter",
 
       aggregate: getFirstVal,
-      Aggregated: ({ cell: { value } }) => `${value}`,
+      Aggregated: () => undefined,
     },
     {
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  W22
Received:

[Killed] MethodExpression
main/components/Sections/SectionsTable.js:160:38
       Header: "Course ID",
       accessor: "courseInfo.courseId",
 
-      Cell: ({ cell: { value } }) => value.substring(0, value.length - 2),
+      Cell: ({ cell: { value } }) => value,
     },
     {
killedBy: CourseOverTimeBuildingsIndexPage tests calls UCSB Course over time search api correctly with correct response
statusReason: TestingLibraryElementError: Unable to find an element with the text: CHEM 184. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArithmeticOperator
main/components/Sections/SectionsTable.js:160:57
       Header: "Course ID",
       accessor: "courseInfo.courseId",
 
-      Cell: ({ cell: { value } }) => value.substring(0, value.length - 2),
+      Cell: ({ cell: { value } }) => value.substring(0, value.length + 2),
     },
     {
killedBy: Section Searches Index Page tests calls UCSB section search api correctly with 1 section response
statusReason: TestingLibraryElementError: Unable to find an element with the text: ECE 1A. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/Sections/SectionsTable.js:163:15
       Cell: ({ cell: { value } }) => value.substring(0, value.length - 2),
     },
     {
-      Header: "Title",
+      Header: "",
       accessor: "courseInfo.title",
       disableGroupBy: true,
killedBy: Section tests Has the expected cell values when expanded
statusReason: TestingLibraryElementError: Unable to find an element with the text: Title. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.js:170:5
       aggregate: getFirstVal,
       Aggregated: ({ cell: { value } }) => `${value}`,
     },
-    {
-      // Stryker disable next-line StringLiteral: this column is hidden, very hard to test
-      Header: "Is Section?",
-      accessor: (row) => isSection(row.section.section),
-      // Stryker disable next-line StringLiteral: this column is hidden, very hard to test
-      id: "isSection",
-    },
+    {},
     {
       Header: "Status",
killedBy: Section tests calls onSuccess when mutation is successful and calls toast with correct parameters
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Sections/SectionsTable.js:173:17
     {
       // Stryker disable next-line StringLiteral: this column is hidden, very hard to test
       Header: "Is Section?",
-      accessor: (row) => isSection(row.section.section),
+      accessor: () => undefined,
       // Stryker disable next-line StringLiteral: this column is hidden, very hard to test
       id: "isSection",
killedBy: Section tests Has the expected cell values when expanded
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SectionsTable-cell-row-2-col-location"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      role="table"
