[Killed] ArrowFunction
main/components/Sections/SectionsTable.js:179:17
     },
     {
       Header: "Status",
-      accessor: (row) => formatStatus(row.section),
+      accessor: () => undefined,
       disableGroupBy: true,
       id: "status",
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Open
Received:
  undefined

[Killed] StringLiteral
main/components/Sections/SectionsTable.js:187:15
       Aggregated: ({ cell: { value } }) => `${value}`,
     },
     {
-      Header: "Enrolled",
+      Header: "",
       accessor: (row) =>
         convertToFraction(row.section.enrolledTotal, row.section.maxEnroll),
killedBy: Section tests Has the expected cell values when expanded
statusReason: TestingLibraryElementError: Unable to find an element with the text: Enrolled. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
main/components/Sections/SectionsTable.js:188:17
     },
     {
       Header: "Enrolled",
-      accessor: (row) =>
-        convertToFraction(row.section.enrolledTotal, row.section.maxEnroll),
+      accessor: () => undefined,
       disableGroupBy: true,
       id: "enrolled",
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  84/100
Received:
  undefined

[Killed] StringLiteral
main/components/Sections/SectionsTable.js:191:11
       accessor: (row) =>
         convertToFraction(row.section.enrolledTotal, row.section.maxEnroll),
       disableGroupBy: true,
-      id: "enrolled",
+      id: "",
 
       aggregate: getFirstVal,
killedBy: Section tests Has the expected cell values when expanded
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SectionsTable-cell-row-0-col-enrolled"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Sections/SectionsTable.js:194:44
       id: "enrolled",
 
       aggregate: getFirstVal,
-      Aggregated: ({ cell: { value } }) => `${value}`,
+      Aggregated: ({ cell: { value } }) => ``,
     },
     {
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  84/100
Received:

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.js:196:5
       aggregate: getFirstVal,
       Aggregated: ({ cell: { value } }) => `${value}`,
     },
-    {
-      Header: "Location",
-      accessor: (row) => formatLocation(row.section.timeLocations),
-      disableGroupBy: true,
-      id: "location",
-
-      aggregate: getFirstVal,
-      Aggregated: ({ cell: { value } }) => `${value}`,
-    },
+    {},
     {
       Header: "Days",
killedBy: Section tests calls onSuccess when mutation is successful and calls toast with correct parameters
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Sections/SectionsTable.js:198:17
     },
     {
       Header: "Location",
-      accessor: (row) => formatLocation(row.section.timeLocations),
+      accessor: () => undefined,
       disableGroupBy: true,
       id: "location",
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  HFH 1124
Received:

[Killed] StringLiteral
main/components/Sections/SectionsTable.js:200:11
       Header: "Location",
       accessor: (row) => formatLocation(row.section.timeLocations),
       disableGroupBy: true,
-      id: "location",
+      id: "",
 
       aggregate: getFirstVal,
killedBy: Section tests Has the expected cell values when expanded
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SectionsTable-cell-row-0-col-location"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
main/components/Sections/SectionsTable.js:207:17
     },
     {
       Header: "Days",
-      accessor: (row) => formatDays(row.section.timeLocations),
+      accessor: () => undefined,
       disableGroupBy: true,
       id: "days",
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  M
Received:
  undefined

[Killed] StringLiteral
main/components/Sections/SectionsTable.js:209:11
       Header: "Days",
       accessor: (row) => formatDays(row.section.timeLocations),
       disableGroupBy: true,
-      id: "days",
+      id: "",
 
       aggregate: getFirstVal,
killedBy: Section tests Has the expected cell values when expanded
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SectionsTable-cell-row-0-col-days"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.js:214:5
       aggregate: getFirstVal,
       Aggregated: ({ cell: { value } }) => `${value}`,
     },
-    {
-      Header: "Time",
-      accessor: (row) => formatTime(row.section.timeLocations),
-      disableGroupBy: true,
-      id: "time",
-
-      aggregate: getFirstVal,
-      Aggregated: ({ cell: { value } }) => `${value}`,
-    },
+    {},
     {
       Header: "Instructor",
killedBy: Section tests calls onSuccess when mutation is successful and calls toast with correct parameters
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Sections/SectionsTable.js:215:15
       Aggregated: ({ cell: { value } }) => `${value}`,
     },
     {
-      Header: "Time",
+      Header: "",
       accessor: (row) => formatTime(row.section.timeLocations),
       disableGroupBy: true,
killedBy: Section tests Has the expected cell values when expanded
statusReason: TestingLibraryElementError: Unable to find an element with the text: Time. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
main/components/Sections/SectionsTable.js:216:17
     },
     {
       Header: "Time",
-      accessor: (row) => formatTime(row.section.timeLocations),
+      accessor: () => undefined,
       disableGroupBy: true,
       id: "time",
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  3:00 PM - 3:50 PM
Received:
  undefined

[Killed] StringLiteral
main/components/Sections/SectionsTable.js:224:15
       Aggregated: ({ cell: { value } }) => `${value}`,
     },
     {
-      Header: "Instructor",
+      Header: "",
       accessor: (row) => formatInstructors(row.section.instructors),
       disableGroupBy: true,
killedBy: Section tests Has the expected cell values when expanded
statusReason: TestingLibraryElementError: Unable to find an element with the text: Instructor. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
main/components/Sections/SectionsTable.js:225:17
     },
     {
       Header: "Instructor",
-      accessor: (row) => formatInstructors(row.section.instructors),
+      accessor: () => undefined,
       disableGroupBy: true,
       id: "instructor",
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  YUNG A S
Received:

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.js:239:5
       aggregate: getFirstVal,
       Aggregated: ({ cell: { value } }) => `${value}`,
     },
-    {
-      Header: "Info",
-      accessor: formatInfoLink,
-      Cell: renderInfoLink,
-      disableGroupBy: true,
-      id: "info",
-
-      aggregate: getFirstVal,
-      Aggregated: renderInfoLink,
-    },
+    {},
     {
       Header: "Action",
killedBy: Section tests calls onSuccess when mutation is successful and calls toast with correct parameters
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Sections/SectionsTable.js:244:11
       accessor: formatInfoLink,
       Cell: renderInfoLink,
       disableGroupBy: true,
-      id: "info",
+      id: "",
 
       aggregate: getFirstVal,
killedBy: Section tests Has the expected cell values when expanded
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SectionsTable-cell-row-0-col-info"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Sections/SectionsTable.js:251:11
     },
     {
       Header: "Action",
-      id: "action",
+      id: "",
       accessor: "section.enrollCode",
       disableGroupBy: true,
killedBy: Section tests calls onSuccess when mutation is successful and calls toast with correct parameters
statusReason: Error: Duplicate columns were found with ids: "section.enrollCode" in the columns array above

[Killed] StringLiteral
main/components/Sections/SectionsTable.js:252:17
     {
       Header: "Action",
       id: "action",
-      accessor: "section.enrollCode",
+      accessor: "",
       disableGroupBy: true,
       // No need for accessor if it's purely for actions like expand/collapse
killedBy: Section tests Correctly groups separate lectures of the same class
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SectionsTable-cell-row-1-col-30395-expand-symbols"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:255:26
       accessor: "section.enrollCode",
       disableGroupBy: true,
       // No need for accessor if it's purely for actions like expand/collapse
-      Cell: ({ row }) => {
-        if (isSection(row.original.section.section) && currentUser.loggedIn) {
-          return (
-            <div className="d-flex align-items-center gap-2">
-              <AddToScheduleModal
-                section={row.original}
-                quarter={row.original.courseInfo.quarter}
-                onAdd={(section, schedule) =>
-                  handleAddToSchedule(section, schedule, mutation)
-                }
-              />
-            </div>
-          );
-        } else {
-          return <div data-testid="empty-action-cell"></div>;
-        }
-      },
+      Cell: ({ row }) => {},
       aggregate: getFirstVal,
       Aggregated: ({ cell: { value }, row }) => {
killedBy: Action Column Tests renders AddToScheduleModal for section rows when user is logged in
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Add
Received:

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.js:256:13
       disableGroupBy: true,
       // No need for accessor if it's purely for actions like expand/collapse
       Cell: ({ row }) => {
-        if (isSection(row.original.section.section) && currentUser.loggedIn) {
+        if (true) {
           return (
             <div className="d-flex align-items-center gap-2">
killedBy: Section tests Has the expected cell values when expanded
statusReason: TypeError: Cannot destructure property 'data' of '(0 , _useBackend.useBackend)(...)' as it is undefined.

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.js:256:13
       disableGroupBy: true,
       // No need for accessor if it's purely for actions like expand/collapse
       Cell: ({ row }) => {
-        if (isSection(row.original.section.section) && currentUser.loggedIn) {
+        if (false) {
           return (
             <div className="d-flex align-items-center gap-2">
killedBy: Action Column Tests renders AddToScheduleModal for section rows when user is logged in
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Add
Received:

[Killed] ArrowFunction
main/components/Sections/SectionsTable.js:262:24
               <AddToScheduleModal
                 section={row.original}
                 quarter={row.original.courseInfo.quarter}
-                onAdd={(section, schedule) =>
-                  handleAddToSchedule(section, schedule, mutation)
+                onAdd={() => undefined
                 }
               />
killedBy: Action Column Tests handleAddToSchedule is called when Modal Add is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:268:16
               />
             </div>
           );
-        } else {
-          return <div data-testid="empty-action-cell"></div>;
-        }
+        } else {}
       },
       aggregate: getFirstVal,
killedBy: Action Column Tests does not render AddToScheduleModal for section rows when user is not logged in
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:273:49
         }
       },
       aggregate: getFirstVal,
-      Aggregated: ({ cell: { value }, row }) => {
-        const testId = `${testid}-cell-row-${row.index}-col-${value}-expand-symbols`;
-        if (isLectureWithNoSections(value, sections) && currentUser.loggedIn) {
-          return (
-            <div className="d-flex align-items-center gap-2">
-              <AddToScheduleModal
-                section={value}
-                quarter={sections[0].courseInfo.quarter}
-                onAdd={(section, schedule) =>
-                  handleLectureAddToSchedule(section, schedule, mutation)
-                }
-              />
-            </div>
-          );
-        } else if (!isLectureWithSections(value, sections)) {
-          return <div data-testid="empty-action-cell"></div>;
-        } else {
-          return (
-            <span {...row.getToggleRowExpandedProps()} data-testid={testId}>
-              {row.isExpanded ? "➖" : "➕"}
-            </span>
-          );
-        }
-      },
+      Aggregated: ({ cell: { value }, row }) => {},
     },
   ];
killedBy: Section tests Correctly groups separate lectures of the same class
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SectionsTable-cell-row-1-col-30395-expand-symbols"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      role="table"

[Killed] LogicalOperator
main/components/Sections/SectionsTable.js:275:13
       aggregate: getFirstVal,
       Aggregated: ({ cell: { value }, row }) => {
         const testId = `${testid}-cell-row-${row.index}-col-${value}-expand-symbols`;
-        if (isLectureWithNoSections(value, sections) && currentUser.loggedIn) {
+        if (isLectureWithNoSections(value, sections) || currentUser.loggedIn) {
           return (
             <div className="d-flex align-items-center gap-2">
killedBy: Section tests calls onSuccess when mutation is successful and calls toast with correct parameters
statusReason: TypeError: Cannot destructure property 'data' of '(0 , _useBackend.useBackend)(...)' as it is undefined.

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:275:79
       aggregate: getFirstVal,
       Aggregated: ({ cell: { value }, row }) => {
         const testId = `${testid}-cell-row-${row.index}-col-${value}-expand-symbols`;
-        if (isLectureWithNoSections(value, sections) && currentUser.loggedIn) {
-          return (
-            <div className="d-flex align-items-center gap-2">
-              <AddToScheduleModal
-                section={value}
-                quarter={sections[0].courseInfo.quarter}
-                onAdd={(section, schedule) =>
-                  handleLectureAddToSchedule(section, schedule, mutation)
-                }
-              />
-            </div>
-          );
-        } else if (!isLectureWithSections(value, sections)) {
+        if (isLectureWithNoSections(value, sections) && currentUser.loggedIn) {} else if (!isLectureWithSections(value, sections)) {
           return <div data-testid="empty-action-cell"></div>;
         } else {
killedBy: Action Column Tests renders AddToScheduleModal for lecture with no sections
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Add
Received:

[Killed] ArrowFunction
main/components/Sections/SectionsTable.js:281:24
               <AddToScheduleModal
                 section={value}
                 quarter={sections[0].courseInfo.quarter}
-                onAdd={(section, schedule) =>
-                  handleLectureAddToSchedule(section, schedule, mutation)
+                onAdd={() => undefined
                 }
               />
killedBy: Action Column Tests handleLectureAddToSchedule is called when Modal Add is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:287:61
               />
             </div>
           );
-        } else if (!isLectureWithSections(value, sections)) {
-          return <div data-testid="empty-action-cell"></div>;
-        } else {
+        } else if (!isLectureWithSections(value, sections)) {} else {
           return (
             <span {...row.getToggleRowExpandedProps()} data-testid={testId}>
killedBy: Action Column Tests Aggregated Action Cell is empty when !isLectureWithSections is true and isLectureWithNoSections is false
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.js:287:20
               />
             </div>
           );
-        } else if (!isLectureWithSections(value, sections)) {
+        } else if (true) {
           return <div data-testid="empty-action-cell"></div>;
         } else {
killedBy: Section tests Correctly groups separate lectures of the same class
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SectionsTable-cell-row-1-col-30395-expand-symbols"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:289:16
           );
         } else if (!isLectureWithSections(value, sections)) {
           return <div data-testid="empty-action-cell"></div>;
-        } else {
-          return (
-            <span {...row.getToggleRowExpandedProps()} data-testid={testId}>
-              {row.isExpanded ? "➖" : "➕"}
-            </span>
-          );
-        }
+        } else {}
       },
     },
killedBy: Section tests Correctly groups separate lectures of the same class
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SectionsTable-cell-row-1-col-30395-expand-symbols"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      role="table"
