[Killed] BooleanLiteral
main/components/Jobs/JobsTable.js:8:13
 
 export default function JobsTable({
   jobs = [],
-  loading = false,
+  loading = true,
   error = null,
   sortBy = { id: "id", desc: true },
killedBy: JobsTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="text-center my-4"
    >

[Killed] BooleanLiteral
main/components/Jobs/JobsTable.js:10:30
   jobs = [],
   loading = false,
   error = null,
-  sortBy = { id: "id", desc: true },
+  sortBy = { id: "id", desc: false },
   onSortChange = () => {},
   onPurge = () => {},
killedBy: JobsTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  🔽
Received:
  🔼

[Killed] BlockStatement
main/components/Jobs/JobsTable.js:14:16
   onSortChange = () => {},
   onPurge = () => {},
 }) {
-  if (loading) {
-    return (
-      <div className="text-center my-4">
-        <Spinner animation="border" />
-      </div>
-    );
-  }
+  if (loading) {}
   if (error) {
     return (
killedBy: JobsTable tests JobsTable shows spinner when loading=true
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] ConditionalExpression
main/components/Jobs/JobsTable.js:14:7
   onSortChange = () => {},
   onPurge = () => {},
 }) {
-  if (loading) {
+  if (false) {
     return (
       <div className="text-center my-4">
killedBy: JobsTable tests JobsTable shows spinner when loading=true
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] BlockStatement
main/components/Jobs/JobsTable.js:21:14
       </div>
     );
   }
-  if (error) {
-    return (
-      <Alert variant="danger" className="my-4">
-        {error}
-      </Alert>
-    );
-  }
+  if (error) {}
 
   const clickHeader = (field) => {
killedBy: AdminJobsPage tests error fetching jobs displays error message
statusReason: Error: Unable to find an element with the text: /Error fetching jobs/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/components/Jobs/JobsTable.js:29:34
     );
   }
 
-  const clickHeader = (field) => {
-    onSortChange(field);
-  };
+  const clickHeader = (field) => {};
 
   const SortIcon = ({ field }) => {
killedBy: JobsTable tests clicking each column header calls onSortChange with the correct field
statusReason: Error: expect(jest.fn()).toHaveBeenLastCalledWith(...expected)

Expected: "id"

Number of calls: 0

[Killed] BlockStatement
main/components/Jobs/JobsTable.js:33:35
     onSortChange(field);
   };
 
-  const SortIcon = ({ field }) => {
-    if (sortBy.id !== field) {
-      return <span data-testid={`JobsTable-header-${field}-sort-carets`} />;
-    }
-    return (
-      <span data-testid={`JobsTable-header-${field}-sort-carets`}>
-        {sortBy.desc ? "🔽" : "🔼"}
-      </span>
-    );
-  };
+  const SortIcon = ({ field }) => {};
 
   return (
killedBy: JobsTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="JobsTable-header-id-sort-carets"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="d-flex justify-content-between align-items-center mb-2"

[Killed] EqualityOperator
main/components/Jobs/JobsTable.js:34:9
   };
 
   const SortIcon = ({ field }) => {
-    if (sortBy.id !== field) {
+    if (sortBy.id === field) {
       return <span data-testid={`JobsTable-header-${field}-sort-carets`} />;
     }
killedBy: JobsTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  🔽
Received:

[Killed] ConditionalExpression
main/components/Jobs/JobsTable.js:34:9
   };
 
   const SortIcon = ({ field }) => {
-    if (sortBy.id !== field) {
+    if (true) {
       return <span data-testid={`JobsTable-header-${field}-sort-carets`} />;
     }
killedBy: JobsTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  🔽
Received:

[Survived] StringLiteral
main/components/Jobs/JobsTable.js:35:33
 
   const SortIcon = ({ field }) => {
     if (sortBy.id !== field) {
-      return <span data-testid={`JobsTable-header-${field}-sort-carets`} />;
+      return <span data-testid={``} />;
     }
     return (

[Killed] StringLiteral
main/components/Jobs/JobsTable.js:38:26
       return <span data-testid={`JobsTable-header-${field}-sort-carets`} />;
     }
     return (
-      <span data-testid={`JobsTable-header-${field}-sort-carets`}>
+      <span data-testid={``}>
         {sortBy.desc ? "🔽" : "🔼"}
       </span>
killedBy: JobsTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="JobsTable-header-id-sort-carets"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="d-flex justify-content-between align-items-center mb-2"

[Killed] StringLiteral
main/components/Jobs/JobsTable.js:39:24
     }
     return (
       <span data-testid={`JobsTable-header-${field}-sort-carets`}>
-        {sortBy.desc ? "🔽" : "🔼"}
+        {sortBy.desc ? "": "🔼"}
       </span>
     );
killedBy: JobsTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  🔽
Received:

[Survived] StringLiteral
main/components/Jobs/JobsTable.js:58:34
           <thead>
             <tr>
               <th
-                style={{ cursor: "pointer" }}
+                style={{ cursor: "" }}
                 onClick={() => clickHeader("id")}
               >

[Killed] ArrowFunction
main/components/Jobs/JobsTable.js:59:26
             <tr>
               <th
                 style={{ cursor: "pointer" }}
-                onClick={() => clickHeader("id")}
+                onClick={() => undefined}
               >
                 id
killedBy: JobsTable tests clicking each column header calls onSortChange with the correct field
statusReason: Error: expect(jest.fn()).toHaveBeenLastCalledWith(...expected)

Expected: "id"

Number of calls: 0

[Killed] ArrowFunction
main/components/Jobs/JobsTable.js:66:26
               </th>
               <th
                 style={{ cursor: "pointer" }}
-                onClick={() => clickHeader("createdAt")}
+                onClick={() => undefined}
               >
                 Created
killedBy: JobsTable tests clicking each column header calls onSortChange with the correct field
statusReason: Error: expect(jest.fn()).toHaveBeenLastCalledWith(...expected)

Expected: "createdAt"
Received: "id"

Number of calls: 1

[Killed] StringLiteral
main/components/Jobs/JobsTable.js:66:44
               </th>
               <th
                 style={{ cursor: "pointer" }}
-                onClick={() => clickHeader("createdAt")}
+                onClick={() => clickHeader("")}
               >
                 Created
killedBy: JobsTable tests clicking each column header calls onSortChange with the correct field
statusReason: Error: expect(jest.fn()).toHaveBeenLastCalledWith(...expected)

Expected: "createdAt"
Received
       1: "id"
->     2: ""

Number of calls: 2

[Killed] ArrowFunction
main/components/Jobs/JobsTable.js:73:26
               </th>
               <th
                 style={{ cursor: "pointer" }}
-                onClick={() => clickHeader("updatedAt")}
+                onClick={() => undefined}
               >
                 Updated
killedBy: JobsTable tests clicking each column header calls onSortChange with the correct field
statusReason: Error: expect(jest.fn()).toHaveBeenLastCalledWith(...expected)

Expected: "updatedAt"
Received
       1: "id"
->     2: "createdAt"

Number of calls: 2

[Survived] ObjectLiteral
main/components/Jobs/JobsTable.js:79:24
                 <SortIcon field="updatedAt" />
               </th>
               <th
-                style={{ cursor: "pointer" }}
+                style={{}}
                 onClick={() => clickHeader("status")}
               >

[Killed] ArrowFunction
main/components/Jobs/JobsTable.js:80:26
               </th>
               <th
                 style={{ cursor: "pointer" }}
-                onClick={() => clickHeader("status")}
+                onClick={() => undefined}
               >
                 Status
killedBy: JobsTable tests clicking each column header calls onSortChange with the correct field
statusReason: Error: expect(jest.fn()).toHaveBeenLastCalledWith(...expected)

Expected: "status"
Received
       2: "createdAt"
->     3: "updatedAt"

Number of calls: 3

[Killed] ConditionalExpression
main/components/Jobs/JobsTable.js:89:14
             </tr>
           </thead>
           <tbody>
-            {jobs.length === 0 ? (
+            {false ? (
               <tr>
                 <td colSpan={5} className="text-center">
killedBy: AdminJobsPage tests unexpected payload shape clears table and shows no-jobs message
statusReason: Error: Unable to find an element with the text: /no jobs to display\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] EqualityOperator
main/components/Jobs/JobsTable.js:89:14
             </tr>
           </thead>
           <tbody>
-            {jobs.length === 0 ? (
+            {jobs.length !== 0 ? (
               <tr>
                 <td colSpan={5} className="text-center">
killedBy: JobsTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="JobsTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="d-flex justify-content-between align-items-center mb-2"

[Killed] LogicalOperator
main/components/Jobs/JobsTable.js:97:29
               </tr>
             ) : (
               jobs.map((job, idx) => {
-                const raw = job.log ?? "";
+                const raw = job.log && "";
                 const lines = raw.split("\n");
                 const needsTruncate = lines.length > 10;
killedBy: JobsTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Hello World! from test job! Goodbye from test job!
Received:
  No logs available

[Killed] StringLiteral
main/components/Jobs/JobsTable.js:97:40
               </tr>
             ) : (
               jobs.map((job, idx) => {
-                const raw = job.log ?? "";
+                const raw = job.log ?? "Stryker was here!";
                 const lines = raw.split("\n");
                 const needsTruncate = lines.length > 10;
killedBy: JobsTable tests displays 'No logs available' when log is empty or null
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  No logs available
Received:
  Stryker was here!

[Killed] ConditionalExpression
main/components/Jobs/JobsTable.js:99:39
               jobs.map((job, idx) => {
                 const raw = job.log ?? "";
                 const lines = raw.split("\n");
-                const needsTruncate = lines.length > 10;
+                const needsTruncate = true;
                 const truncated = lines.slice(0, 10).join("\n");
 
killedBy: JobsTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Hello World! from test job! Goodbye from test job!
Received:
  Hello World! from test job!Goodbye from test job!...See entire log

[Killed] EqualityOperator
main/components/Jobs/JobsTable.js:99:39
               jobs.map((job, idx) => {
                 const raw = job.log ?? "";
                 const lines = raw.split("\n");
-                const needsTruncate = lines.length > 10;
+                const needsTruncate = lines.length <= 10;
                 const truncated = lines.slice(0, 10).join("\n");
 
killedBy: JobsTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Hello World! from test job! Goodbye from test job!
Received:
  Hello World! from test job!Goodbye from test job!...See entire log

[Killed] MethodExpression
main/components/Jobs/JobsTable.js:100:35
                 const raw = job.log ?? "";
                 const lines = raw.split("\n");
                 const needsTruncate = lines.length > 10;
-                const truncated = lines.slice(0, 10).join("\n");
+                const truncated = lines.join("\n");
 
                 const formatValue = (value) => {
killedBy: JobsTable tests renders long logs and handles truncation (snapshot)
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `JobsTable tests renders long logs and handles truncation (snapshot) 1`

- Snapshot  -  0
+ Received  + 22

@@ -41,10 +41,32 @@

[Killed] BlockStatement
main/components/Jobs/JobsTable.js:102:48
                 const needsTruncate = lines.length > 10;
                 const truncated = lines.slice(0, 10).join("\n");
 
-                const formatValue = (value) => {
-                  if (typeof value === "string") {
-                    return new Date(value).toLocaleString(undefined, {
-                      hour12: false,
-                    });
-                  }
-                  return value;
-                };
+                const formatValue = (value) => {};
 
                 return (
killedBy: JobsTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  11/13/2022, 19:49:59
Received:

[Killed] BlockStatement
main/components/Jobs/JobsTable.js:103:50
                 const truncated = lines.slice(0, 10).join("\n");
 
                 const formatValue = (value) => {
-                  if (typeof value === "string") {
-                    return new Date(value).toLocaleString(undefined, {
-                      hour12: false,
-                    });
-                  }
+                  if (typeof value === "string") {}
                   return value;
                 };
killedBy: JobsTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  11/13/2022, 19:49:59
Received:
  2022-11-13T19:49:59.203879-08:00

[Killed] ConditionalExpression
main/components/Jobs/JobsTable.js:103:23
                 const truncated = lines.slice(0, 10).join("\n");
 
                 const formatValue = (value) => {
-                  if (typeof value === "string") {
+                  if (false) {
                     return new Date(value).toLocaleString(undefined, {
                       hour12: false,
killedBy: JobsTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  11/13/2022, 19:49:59
Received:
  2022-11-13T19:49:59.203879-08:00

[Killed] BooleanLiteral
main/components/Jobs/JobsTable.js:105:31
                 const formatValue = (value) => {
                   if (typeof value === "string") {
                     return new Date(value).toLocaleString(undefined, {
-                      hour12: false,
+                      hour12: true,
                     });
                   }
killedBy: JobsTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  11/13/2022, 19:49:59
Received:
  11/13/2022, 7:49:59 PM

[Killed] ConditionalExpression
main/components/Jobs/JobsTable.js:126:24
                       {job.status}
                     </td>
                     <td data-testid={`JobsTable-cell-row-${idx}-col-Log`}>
-                      {raw === "" ? (
+                      {true ? (
                         <span>No logs available</span>
                       ) : needsTruncate ? (
killedBy: JobsTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Hello World! from test job! Goodbye from test job!
Received:
  No logs available

[Killed] EqualityOperator
main/components/Jobs/JobsTable.js:126:24
                       {job.status}
                     </td>
                     <td data-testid={`JobsTable-cell-row-${idx}-col-Log`}>
-                      {raw === "" ? (
+                      {raw !== "" ? (
                         <span>No logs available</span>
                       ) : needsTruncate ? (
killedBy: JobsTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Hello World! from test job! Goodbye from test job!
Received:
  No logs available
