[Killed] ArrowFunction
main/components/Utils/OurPagination.js:4:27
 import React, { useState } from "react";
 import { Pagination } from "react-bootstrap";
 
-export const emptyArray = () => []; // factored out for Stryker testing
+export const emptyArray = () => undefined; // factored out for Stryker testing
 
 const OurPagination = ({
killedBy: OurPagination tests emptyArray returns empty array
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] BlockStatement
main/components/Utils/OurPagination.js:12:26
   testId = "OurPagination",
 }) => {
   const [activePage, setActivePage] = useState(1);
-  const nextPage = () => {
-    const newPage = Math.min(activePage + 1, totalPages);
-    setActivePage(newPage);
-    updateActivePage(newPage);
-  };
+  const nextPage = () => {};
   const prevPage = () => {
     const newPage = Math.max(activePage - 1, 1);
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 8 (middle range, next clicks)
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="OurPagination-left-ellipsis"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] BlockStatement
main/components/Utils/OurPagination.js:17:26
     setActivePage(newPage);
     updateActivePage(newPage);
   };
-  const prevPage = () => {
-    const newPage = Math.max(activePage - 1, 1);
-    setActivePage(newPage);
-    updateActivePage(newPage);
-  };
+  const prevPage = () => {};
   const thisPage = (page) => {
     setActivePage(page);
killedBy: OurPagination tests navigation: prev button works correctly
statusReason: Error: expect(element).toHaveClass("active")

Expected the element to have class:
  active
Received:
  page-item

[Killed] BlockStatement
main/components/Utils/OurPagination.js:22:30
     setActivePage(newPage);
     updateActivePage(newPage);
   };
-  const thisPage = (page) => {
-    setActivePage(page);
-    updateActivePage(page);
-  };
+  const thisPage = (page) => {};
 
   const pageButton = (number) => (
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 5 (middle range)
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="OurPagination-left-ellipsis"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] BlockStatement
main/components/Utils/OurPagination.js:38:47
     </Pagination.Item>
   );
 
-  const generateSimplePaginationItems = () => {
-    const paginationItems = emptyArray();
-    for (let number = 1; number <= totalPages; number++) {
-      paginationItems.push(pageButton(number));
-    }
-    return paginationItems;
-  };
+  const generateSimplePaginationItems = () => {};
 
   const generateComplexPaginationItems = () => {
killedBy: OurPagination tests renders correctly for totalPages = 5 (less than or equal to 7)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7
Received: 2

[Killed] ConditionalExpression
main/components/Utils/OurPagination.js:40:26
 
   const generateSimplePaginationItems = () => {
     const paginationItems = emptyArray();
-    for (let number = 1; number <= totalPages; number++) {
+    for (let number = 1; false; number++) {
       paginationItems.push(pageButton(number));
     }
killedBy: OurPagination tests renders correctly for totalPages = 5 (less than or equal to 7)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7
Received: 2

[Killed] EqualityOperator
main/components/Utils/OurPagination.js:40:26
 
   const generateSimplePaginationItems = () => {
     const paginationItems = emptyArray();
-    for (let number = 1; number <= totalPages; number++) {
+    for (let number = 1; number < totalPages; number++) {
       paginationItems.push(pageButton(number));
     }
killedBy: OurPagination tests renders correctly for totalPages = 5 (less than or equal to 7)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7
Received: 6
